--------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/leonardoleon/Library/Mobile Documents/com~apple~CloudDocs/Universidad/UPC/9no ciclo/Tesis 1/Base de datos 5t
> o censo económico anual/Base curada/analisis_supervivencia_$(S_DATE).log
  log type:  text
 opened on:   6 Oct 2025, 00:51:37

. 
. // Cargar base de datos
. use "2.v_censo_limpio.dta", clear

. 
. /*=============================================================================
> 1. PREPARACIÓN DE VARIABLES
> =============================================================================*/
. 
. // Verificar productividad negativa
. count if productividad_x_trabajador < 0
  285

. summarize productividad_x_trabajador, detail

     Productividad laboral: VAB promedio por trabajador
                         (INEI 2022)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0       -3845757
 5%     864.1382       -3832051
10%      1365.75       -1536723       Obs           1,332,459
25%     2572.346       -1115009       Sum of wgt.   1,332,459

50%     5325.188                      Mean           13125.34
                        Largest       Std. dev.      115045.6
75%     11570.25       3.27e+07
90%     25127.33       3.34e+07       Variance       1.32e+10
95%        41595       7.08e+07       Skewness       505.3173
99%     126223.6       8.35e+07       Kurtosis       327010.7

. 
. // SOLUCIÓN A PRODUCTIVIDAD NEGATIVA
. // Opciones: (1) Eliminar obs negativas, (2) Usar valor absoluto, (3) Truncar en 0
. // Recomendación econométrica: truncar en valor mínimo positivo para evitar perder observaciones
. 
. // Identificar el mínimo positivo
. quietly summarize productividad_x_trabajador if productividad_x_trabajador > 0, detail

. local min_pos = r(min)

. display "Mínimo valor positivo de productividad: " `min_pos'
Mínimo valor positivo de productividad: .017

. 
. // Opción 1: Truncar valores negativos en el mínimo positivo
. capture drop productividad_clean

. gen productividad_clean = productividad_x_trabajador
(45,472 missing values generated)

. replace productividad_clean = `min_pos' if productividad_x_trabajador <= 0 & !missing(productividad_x_trabajador)
(16,935 real changes made)

. 
. // Variables en niveles para evitar problemas de convergencia
. // Escalando por 1000 para reducir magnitudes
. capture drop productividad_k tributos_k salarios_k

. gen productividad_k = productividad_clean / 1000
(45,472 missing values generated)

. gen tributos_k = tributos / 1000
(5,675 missing values generated)

. gen salarios_k = salarios / 1000
(5,675 missing values generated)

. 
. // Dividir por 1000 para reducir valores en lugar de logaritmo natural (porque seria interpretar el % del %)
. // Productividad según definición oficial INEI: Valor Agregado Bruto (VAB) / Trabajadores Ocupados
. // donde VAB = Ventas - Consumo Intermedio (variable VALOR_AGREGADO del V Censo 2022)
. // Correlación moderada-alta con ventas por construcción (VIF esperado: 4-8)
. // Decisión de especificación: calcular VIF; si VIF<10 incluir ambas; si VIF>=10 priorizar ventas
. // Usar logit op2021_original c.ruc##(i.region) ventas_soles_2021 sexo_gerente productividad_k digital_score tributos_k salari
> os_k i.tipo_local i.regimen, vce(cluster ciiu_4dig) en lugar de sector dado que sector comercio, manufacturas y servicio es mu
> y poco, mejor agrupar por CIIU lo cual significa agrupar por los primeros 4 dígitos (Clase), es decir 0111, 0112, para de esta
>  manera agrupar empresas que se dedican a actividades más específicas. Mayor granularidad (4 vs 2 dígitos) captura mejor la he
> terogeneidad intra-sectorial. El comando vce cluster lo que hace es "limpiar" un poco la heterogeneidad y sesgo que se genera 
> al tener empresas que se dedican a diferentes rubros
. // al usar comando margins region , dydx(ruc) esto me permite hacer gráficos para ver cómo evoluciona supervivencia según aume
> nta el tamaño de la empresa, etc (idea del profesor)
. 
. 
. // Variables dummy regionales (Costa como base)
. capture drop sierra selva

. gen sierra = (region == 1)

. gen selva = (region == 2)

. 
. // Estadísticas descriptivas esenciales
. tab op2021_original region, col nofreq

        Operación del |
   establecimiento en |    Región geográfica del Perú
                 2021 |     Costa     Sierra      Selva |     Total
----------------------+---------------------------------+----------
Prácticamente no oper |     44.55      51.88      47.64 |     47.17 
Operó, al menos, parc |     55.45      48.12      52.36 |     52.83 
----------------------+---------------------------------+----------
                Total |    100.00     100.00     100.00 |    100.00 

. tab op2021_original ruc, col nofreq

        Operación del |    Tenencia de RUC
   establecimiento en |     (Formalidad)
                 2021 | Informal   Formal (c |     Total
----------------------+----------------------+----------
Prácticamente no oper |     53.57      44.02 |     47.17 
Operó, al menos, parc |     46.43      55.98 |     52.83 
----------------------+----------------------+----------
                Total |    100.00     100.00 |    100.00 

. tabstat ventas_soles_2021, by(op2021_original) statistics(mean median sd min max n)

Summary for variables: ventas_soles_2021
Group variable: op2021_original (Operación del establecimiento en 2021)

 op2021_original |      Mean       p50        SD       Min       Max         N
-----------------+------------------------------------------------------------
Prácticamente no |   59421.6     18000  252117.5         0   7439552    649927
Operó, al menos, |  186403.1     33000    663163         0   7478655    727867
-----------------+------------------------------------------------------------
           Total |  126503.9     25000    516075         0   7478655   1377794
------------------------------------------------------------------------------

. 
end of do-file

. cls

. do "/var/folders/zq/3f506wxj6djb98qwd23px8lh0000gn/T//SD46295.000000"

. /*=============================================================================
> 2. ANÁLISIS DE ENDOGENEIDAD Y SESGO DE SELECCIÓN
> =============================================================================*/
. 
. /*-----------------------------------------------------------------------------
> 2.1 TEST DE BALANCE: CARACTERÍSTICAS FORMALES VS INFORMALES
> 
> Objetivo: Evaluar si empresas formales (RUC=1) e informales (RUC=0) son
> comparables en características observables PRE-TRATAMIENTO.
> 
> Implicaciones:
> - Diferencias grandes → Sesgo de selección fuerte (auto-selección en formalización)
> - Comparabilidad → Menor preocupación por endogeneidad (condicional a controles)
> 
> Variables evaluadas:
> - Exógenas: región, sector, sexo gerente, tipo local
> - Potencialmente endógenas: ventas, productividad, digitalización
> - Post-tratamiento: tributos, salarios (solo formales pueden reportar)
> -----------------------------------------------------------------------------*/
. 
. display ""


. display "═══════════════════════════════════════════════════════════════"
═══════════════════════════════════════════════════════════════

. display "TEST DE BALANCE: FORMALES (RUC=1) VS INFORMALES (RUC=0)"
TEST DE BALANCE: FORMALES (RUC=1) VS INFORMALES (RUC=0)

. display "═══════════════════════════════════════════════════════════════"
═══════════════════════════════════════════════════════════════

. display ""


. 
. // Distribución básica
. display "Distribución de formalización en la muestra:"
Distribución de formalización en la muestra:

. tab ruc, missing

   Tenencia de RUC |
      (Formalidad) |      Freq.     Percent        Cum.
-------------------+-----------------------------------
Informal (sin RUC) |    455,024       33.02       33.02
  Formal (con RUC) |    922,907       66.98      100.00
-------------------+-----------------------------------
             Total |  1,377,931      100.00

. display ""


. 
. /*--- Variables continuas: Test de diferencias en medias ---*/
. 
. display "──────────────────────────────────────────────────────────────"
──────────────────────────────────────────────────────────────

. display "A. VARIABLES ECONÓMICAS (potencialmente endógenas)"
A. VARIABLES ECONÓMICAS (potencialmente endógenas)

. display "──────────────────────────────────────────────────────────────"
──────────────────────────────────────────────────────────────

. 
. // Ventas
. display ""


. display "1. VENTAS ANUALES 2021 (soles):"
1. VENTAS ANUALES 2021 (soles):

. ttest ventas_soles_2021, by(ruc)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
Informal | 455,024    30472.87    107.3729    72428.87    30262.42    30683.32
Formal ( | 922,907    174169.8    649.7203    624173.6    172896.3    175443.2
---------+--------------------------------------------------------------------
Combined | 1377931    126717.8    440.3892    516952.2    125854.6    127580.9
---------+--------------------------------------------------------------------
    diff |           -143696.9    928.3787               -145516.5   -141877.3
------------------------------------------------------------------------------
    diff = mean(Informal) - mean(Formal ()                        t = -1.5e+02
H0: diff = 0                                     Degrees of freedom =  1.4e+06

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 1.0000

. 
. // Productividad (antes de winsorización)
. display ""


. display "2. PRODUCTIVIDAD LABORAL (VAB/Trabajador, miles S/.):"
2. PRODUCTIVIDAD LABORAL (VAB/Trabajador, miles S/.):

. gen productividad_temp = productividad_x_trabajador / 1000
(45,472 missing values generated)

. ttest productividad_temp, by(ruc)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
Informal | 454,865    6.528034    .0145432     9.80844     6.49953    6.556539
Formal ( | 877,594    16.54478    .1510054    141.4618    16.24881    16.84074
---------+--------------------------------------------------------------------
Combined | 1332459    13.12534    .0996651    115.0456       12.93    13.32068
---------+--------------------------------------------------------------------
    diff |           -10.01674    .2100093               -10.42835   -9.605132
------------------------------------------------------------------------------
    diff = mean(Informal) - mean(Formal ()                        t = -47.6967
H0: diff = 0                                     Degrees of freedom =  1.3e+06

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 1.0000

. drop productividad_temp

. 
. // Digitalización
. display ""


. display "3. DIGITAL SCORE (0-3):"
3. DIGITAL SCORE (0-3):

. ttest digital_score, by(ruc)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
Informal | 455,024    .1611629    .0005942    .4008089    .1599983    .1623275
Formal ( | 922,907    .4997394    .0007964    .7651268    .4981784    .5013004
---------+--------------------------------------------------------------------
Combined | 1377931    .3879338    .0005843    .6859329    .3867885    .3890791
---------+--------------------------------------------------------------------
    diff |           -.3385765    .0012086               -.3409452   -.3362077
------------------------------------------------------------------------------
    diff = mean(Informal) - mean(Formal ()                        t = -2.8e+02
H0: diff = 0                                     Degrees of freedom =  1.4e+06

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 1.0000

. 
. display ""


. display "──────────────────────────────────────────────────────────────"
──────────────────────────────────────────────────────────────

. display "B. VARIABLES POST-TRATAMIENTO (solo observables en formales)"
B. VARIABLES POST-TRATAMIENTO (solo observables en formales)

. display "──────────────────────────────────────────────────────────────"
──────────────────────────────────────────────────────────────

. 
. // Tributos
. display ""


. display "4. TRIBUTOS PAGADOS 2021 (miles S/.):"
4. TRIBUTOS PAGADOS 2021 (miles S/.):

. gen tributos_temp = tributos / 1000
(5,675 missing values generated)

. ttest tributos_temp, by(ruc)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
Informal | 454,865    .3668362    .0032242    2.174493     .360517    .3731555
Formal ( | 917,391    2.089095    .0510278    48.87469    1.989082    2.189107
---------+--------------------------------------------------------------------
Combined | 1372256    1.518213    .0341372    39.98949    1.451306    1.585121
---------+--------------------------------------------------------------------
    diff |           -1.722258     .072503               -1.864362   -1.580155
------------------------------------------------------------------------------
    diff = mean(Informal) - mean(Formal ()                        t = -23.7543
H0: diff = 0                                     Degrees of freedom =  1.4e+06

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 1.0000

. drop tributos_temp

. 
. // Salarios
. display ""


. display "5. REMUNERACIONES 2021 (miles S/.):"
5. REMUNERACIONES 2021 (miles S/.):

. gen salarios_temp = salarios / 1000
(5,675 missing values generated)

. ttest salarios_temp, by(ruc)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
Informal | 454,865    1.798724    .0127149    8.575396    1.773803    1.823645
Formal ( | 917,391    27.94334    .4032366    386.2221    27.15301    28.73367
---------+--------------------------------------------------------------------
Combined | 1372256    19.27712    .2698123    316.0671     18.7483    19.80595
---------+--------------------------------------------------------------------
    diff |           -26.14462    .5727288               -27.26715   -25.02209
------------------------------------------------------------------------------
    diff = mean(Informal) - mean(Formal ()                        t = -45.6492
H0: diff = 0                                     Degrees of freedom =  1.4e+06

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 1.0000

. drop salarios_temp

. 
. /*--- Variables categóricas: Test de independencia (Chi²) ---*/
. 
. display ""


. display "──────────────────────────────────────────────────────────────"
──────────────────────────────────────────────────────────────

. display "C. VARIABLES EXÓGENAS (pre-determinadas)"
C. VARIABLES EXÓGENAS (pre-determinadas)

. display "──────────────────────────────────────────────────────────────"
──────────────────────────────────────────────────────────────

. 
. // Distribución regional
. display ""


. display "6. DISTRIBUCIÓN REGIONAL:"
6. DISTRIBUCIÓN REGIONAL:

. tab region ruc, chi2 col nofreq

    Región |
 geográfic |    Tenencia de RUC
     a del |     (Formalidad)
      Perú | Informal   Formal (c |     Total
-----------+----------------------+----------
     Costa |     54.58      62.17 |     59.67 
    Sierra |     36.93      30.27 |     32.47 
     Selva |      8.50       7.55 |      7.87 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(2) =  7.4e+03   Pr = 0.000

. 
. // Distribución sectorial
. display ""


. display "7. DISTRIBUCIÓN SECTORIAL:"
7. DISTRIBUCIÓN SECTORIAL:

. tab sector ruc, chi2 col nofreq

           |    Tenencia de RUC
    Sector |     (Formalidad)
 Económico | Informal   Formal (c |     Total
-----------+----------------------+----------
 Comercial |     75.54      59.00 |     64.49 
Productivo |      6.40       8.89 |      8.06 
 Servicios |     18.06      32.11 |     27.45 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(2) =  3.7e+04   Pr = 0.000

. 
. // Género del gerente
. display ""


. display "8. GÉNERO DEL GERENTE:"
8. GÉNERO DEL GERENTE:

. tab sexo_gerente ruc, chi2 col nofreq

    Género |
       del |    Tenencia de RUC
   gerente |     (Formalidad)
 del local | Informal   Formal (c |     Total
-----------+----------------------+----------
     Mujer |     68.96      51.71 |     57.40 
    Hombre |     31.04      48.29 |     42.60 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(1) =  3.7e+04   Pr = 0.000

. 
. // Tipo de local
. display ""


. display "9. TIPO DE LOCAL:"
9. TIPO DE LOCAL:

. tab tipo_local ruc, chi2 col nofreq

           |    Tenencia de RUC
 Propiedad |     (Formalidad)
 del local | Informal   Formal (c |     Total
-----------+----------------------+----------
    Propio |     56.26      50.56 |     52.44 
 Alquilado |     40.28      47.92 |     45.40 
      Otro |      3.46       1.52 |      2.16 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

          Pearson chi2(2) =  1.1e+04   Pr = 0.000

. 
. /*--- Tabla resumen de estadísticas descriptivas ---*/
. 
. display ""


. display "──────────────────────────────────────────────────────────────"
──────────────────────────────────────────────────────────────

. display "D. RESUMEN DE ESTADÍSTICAS DESCRIPTIVAS POR FORMALIZACIÓN"
D. RESUMEN DE ESTADÍSTICAS DESCRIPTIVAS POR FORMALIZACIÓN

. display "──────────────────────────────────────────────────────────────"
──────────────────────────────────────────────────────────────

. display ""


. 
. tabstat ventas_soles_2021 productividad_x_trabajador digital_score, ///
>     by(ruc) statistics(mean median sd min max n) ///
>     columns(statistics) format(%12.2f) ///
>     longstub

ruc                  Variable |         Mean          p50           SD          Min          Max            N
------------------------------+------------------------------------------------------------------------------
Informal (sin RU ventas_sol~1 |     30472.87     15600.00     72428.87      1200.00   6500000.00    455024.00
                 productivi~r |      6528.03      3902.18      9808.44    -10510.87   1242587.88    454865.00
                 digital_sc~e |         0.16         0.00         0.40         0.00         3.00    455024.00
------------------------------+------------------------------------------------------------------------------
Formal (con RUC) ventas_sol~1 |    174169.76     30000.00    624173.60         0.00   7478655.00    922907.00
                 productivi~r |     16544.78      6307.88    141461.81  -3845757.25  83523648.00    877594.00
                 digital_sc~e |         0.50         0.00         0.77         0.00         3.00    922907.00
------------------------------+------------------------------------------------------------------------------
Total            ventas_sol~1 |    126717.79     25000.00    516952.23         0.00   7478655.00   1377931.00
                 productivi~r |     13125.34      5325.19    115045.56  -3845757.25  83523648.00   1332459.00
                 digital_sc~e |         0.39         0.00         0.69         0.00         3.00   1377931.00
-------------------------------------------------------------------------------------------------------------

. 
. display ""


. display "═══════════════════════════════════════════════════════════════"
═══════════════════════════════════════════════════════════════

. display "INTERPRETACIÓN DEL TEST DE BALANCE:"
INTERPRETACIÓN DEL TEST DE BALANCE:

. display "═══════════════════════════════════════════════════════════════"
═══════════════════════════════════════════════════════════════

. display "- p-value < 0.05: Diferencia estadísticamente significativa"
- p-value < 0.05: Diferencia estadísticamente significativa

. display "  → Evidencia de SESGO DE SELECCIÓN en formalización"
  → Evidencia de SESGO DE SELECCIÓN en formalización

. display "  → Empresas formales/informales NO son comparables en esa variable"
  → Empresas formales/informales NO son comparables en esa variable

. display ""


. display "- Implicación: Modelo debe controlar exhaustivamente por observables"
- Implicación: Modelo debe controlar exhaustivamente por observables

. display "  para mitigar sesgo de variable omitida (estrategia: selection on observables)"
  para mitigar sesgo de variable omitida (estrategia: selection on observables)

. display "═══════════════════════════════════════════════════════════════"
═══════════════════════════════════════════════════════════════

. display ""


. 
end of do-file

. cls

. do "/var/folders/zq/3f506wxj6djb98qwd23px8lh0000gn/T//SD46295.000000"

. /*-----------------------------------------------------------------------------
> 2.2 EVALUACIÓN DE ENDOGENEIDAD POR RÉGIMEN TRIBUTARIO
> 
> Objetivo: Analizar si elección de régimen tributario está correlacionada con
> características empresariales (evidencia de auto-selección)
> -----------------------------------------------------------------------------*/
. 
. display ""


. display "═══════════════════════════════════════════════════════════════"
═══════════════════════════════════════════════════════════════

. display "ANÁLISIS DE ENDOGENEIDAD: RÉGIMEN TRIBUTARIO"
ANÁLISIS DE ENDOGENEIDAD: RÉGIMEN TRIBUTARIO

. display "═══════════════════════════════════════════════════════════════"
═══════════════════════════════════════════════════════════════

. display ""


. 
. // Test de diferencias por régimen tributario (ANOVA)
. display "Test ANOVA: ¿Difiere productividad entre regímenes tributarios?"
Test ANOVA: ¿Difiere productividad entre regímenes tributarios?

. oneway productividad_x_trabajador regimen, tabulate

            |  Summary of Productividad laboral:
            |  VAB promedio por trabajador (INEI
    Régimen |                2022)
 Tributario |        Mean   Std. dev.       Freq.
------------+------------------------------------
    Ninguno |   6905.6966   12505.884     550,091
  Nuevo Rég |   10302.944    30092.49     484,849
  Régimen E |   17681.778   50470.925      82,780
  Régimen M |   26573.078   72680.569      90,848
  Régimen G |    38881.19   362661.13     123,891
------------+------------------------------------
      Total |   13125.336   115045.56   1,332,459

                        Analysis of variance
    Source              SS         df      MS            F     Prob > F
------------------------------------------------------------------------
Between groups      1.2547e+14      4   3.1369e+13   2387.02     0.0000
 Within groups      1.7510e+161332454   1.3141e+10
------------------------------------------------------------------------
    Total           1.7636e+161332458   1.3235e+10

Bartlett's equal-variances test: chi2(4) =  3.7e+06    Prob>chi2 = 0.000

. 
. // Winsorización para outliers extremos (preparación para modelo)
. display ""


. display "Aplicando winsorización a productividad (1%-99%)..."
Aplicando winsorización a productividad (1%-99%)...

. quietly summarize productividad_x_trabajador, detail

. local p1 = r(p1)

. local p99 = r(p99)

. replace productividad_k = `p1' / 1000 if productividad_x_trabajador < `p1' & !missing(productividad_x_trabajador)
(285 real changes made)

. replace productividad_k = `p99' / 1000 if productividad_x_trabajador > `p99' & !missing(productividad_x_trabajador)
(13,323 real changes made)

. label var productividad_k "Productividad winsorizada (1%-99%), miles S/."

. display "Productividad winsorizada completada."
Productividad winsorizada completada.

. 
. // Diagnósticos adicionales
. display ""


. display "Diferencias en ventas entre empresas operativas/no operativas:"
Diferencias en ventas entre empresas operativas/no operativas:

. ttest ventas_soles_2021, by(op2021_original)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
Práctica | 649,927     59421.6    312.7308    252117.5    58808.66    60034.54
Operó, a | 727,867    186403.1    777.3101      663163    184879.5    187926.6
---------+--------------------------------------------------------------------
Combined | 1377794    126503.9    439.6638      516075    125642.2    127365.6
---------+--------------------------------------------------------------------
    diff |           -126981.5    874.0691               -128694.6   -125268.3
------------------------------------------------------------------------------
    diff = mean(Práctica) - mean(Operó, a)                        t = -1.5e+02
H0: diff = 0                                     Degrees of freedom =  1.4e+06

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 1.0000

. 
. display ""


. display "Asociación entre supervivencia y régimen tributario:"
Asociación entre supervivencia y régimen tributario:

. tab op2021_original regimen, chi2 V

        Operación del |
   establecimiento en |                   Régimen Tributario
                 2021 |   Ninguno  Nuevo Rég  Régimen E  Régimen M  Régimen G |     Total
----------------------+-------------------------------------------------------+----------
Prácticamente no oper |   298,461    238,459     42,345     37,364     33,298 |   649,927 
Operó, al menos, parc |   252,140    249,929     41,271     59,482    125,045 |   727,867 
----------------------+-------------------------------------------------------+----------
                Total |   550,601    488,388     83,616     96,846    158,343 | 1,377,794 

          Pearson chi2(4) =  5.8e+04   Pr = 0.000
               Cramér's V =   0.2055

. 
. display ""


. display "Correlación entre variables económicas (multicolinealidad):"
Correlación entre variables económicas (multicolinealidad):

. corr productividad_k tributos_k salarios_k
(obs=1,332,459)

             | produc~k tribut~k salari~k
-------------+---------------------------
productivi~k |   1.0000
  tributos_k |   0.1043   1.0000
  salarios_k |   0.1589   0.3302   1.0000


. 
. display ""


. display "═══════════════════════════════════════════════════════════════"
═══════════════════════════════════════════════════════════════

. 
end of do-file

. cls

. do "/var/folders/zq/3f506wxj6djb98qwd23px8lh0000gn/T//SD46295.000000"

. /*=============================================================================
> 3. MODELO PRINCIPAL: EFECTOS HETEROGÉNEOS DE FORMALIZACIÓN
> =============================================================================*/
. // Es necesario estandarizar la variable de ventas ventas_soles_2021 con la siguiente operación: restar media y dividir entre 
> desviacion estandar para estandarizar la venta. Hecho esto debemos usar ventas_soles_2021 estandarizada en lugar de ventas_sol
> es_2021. Actualmente, si usamos el comando "hist ventas_soles_2021", la variable ventas_soles_2021 está sesgada al 0, al estan
> darizarla se obtiene una distribución de campana.
. 
. summarize ventas_soles_2021

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
ventas_sol~1 |  1,377,931    126717.8    516952.2          0    7478655

. capture drop ventas_std

. gen ventas_std = (ventas_soles_2021 - r(mean)) / r(sd)

. label variable ventas_std "Ventas 2021 estandarizadas (media=0, sd=1)"

. 
. // Modelo completo con interacciones RUC*Región
. // Especificación según ecuación del paper (Sección 5. ESTRATEGIA EMPÍRICA):
. // - Incluye sector económico como control estructural (Comercial, Productivo, Servicios)
. // - Clustering por CIIU 4 dígitos (Clase): Máxima granularidad sectorial disponible
. //   Justificación: Mayor desagregación captura heterogeneidad intra-sectorial más precisa
. //   (recomendación del asesor: "mientras más granular, mejor" dado tamaño censal N=1.3M)
. //   Cameron & Miller (2015) sugieren maximizar clusters cuando N es suficientemente grande
. logit op2021_original c.ruc##(i.region) ventas_std i.sector sexo_gerente productividad_k digital_score tributos_k salarios_k i
> .tipo_local i.regimen, vce(cluster ciiu_4dig)

Iteration 0:  Log pseudolikelihood = -919800.61  
Iteration 1:  Log pseudolikelihood = -877875.63  
Iteration 2:  Log pseudolikelihood =  -877201.6  
Iteration 3:  Log pseudolikelihood =  -877190.2  
Iteration 4:  Log pseudolikelihood = -877190.14  
Iteration 5:  Log pseudolikelihood = -877190.14  

Logistic regression                                  Number of obs = 1,327,956
                                                     Wald chi2(19) =   1581.95
                                                     Prob > chi2   =    0.0000
Log pseudolikelihood = -877190.14                    Pseudo R2     =    0.0463

                                                       (Std. err. adjusted for 335 clusters in ciiu_4dig)
---------------------------------------------------------------------------------------------------------
                                        |               Robust
                        op2021_original | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
----------------------------------------+----------------------------------------------------------------
                                    ruc |  -.2160872   .0801533    -2.70   0.007    -.3731848   -.0589897
                                        |
                                 region |
                                Sierra  |  -.4231821   .0594118    -7.12   0.000     -.539627   -.3067371
                                 Selva  |  -.1344804   .0396178    -3.39   0.001    -.2121298   -.0568309
                                        |
                           region#c.ruc |
                                Sierra  |   .2622429   .0743699     3.53   0.000     .1164807    .4080052
                                 Selva  |   -.012587   .0628289    -0.20   0.841    -.1357294    .1105554
                                        |
                             ventas_std |    .145499   .0222635     6.54   0.000     .1018633    .1891347
                                        |
                                 sector |
                            Productivo  |  -.0426904    .103493    -0.41   0.680    -.2455329    .1601521
                             Servicios  |  -.0491771   .0809955    -0.61   0.544    -.2079254    .1095711
                                        |
                           sexo_gerente |   .0321469   .0333163     0.96   0.335    -.0331519    .0974456
                        productividad_k |   .0131288   .0019953     6.58   0.000     .0092181    .0170395
                          digital_score |  -.1109475   .0235251    -4.72   0.000    -.1570558   -.0648393
                             tributos_k |  -.0001825   .0002759    -0.66   0.508    -.0007233    .0003583
                             salarios_k |   .0000544    .000067     0.81   0.417    -.0000769    .0001857
                                        |
                             tipo_local |
                             Alquilado  |  -.4589818   .0681475    -6.74   0.000    -.5925484   -.3254152
                                  Otro  |  -.4239409   .0724621    -5.85   0.000    -.5659641   -.2819178
                                        |
                                regimen |
Nuevo Régimen Único Simplificado (RUS)  |   .2830046   .0398454     7.10   0.000      .204909    .3611002
       Régimen Especial de Renta (RER)  |   .2302953   .0643892     3.58   0.000     .1040948    .3564957
         Régimen MYPE Tributario (RMT)  |   .6122861   .0785644     7.79   0.000     .4583027    .7662694
                  Régimen General (RG)  |   1.157923   .1793555     6.46   0.000      .806393    1.509454
                                        |
                                  _cons |   .1814816   .1132584     1.60   0.109    -.0405008    .4034641
---------------------------------------------------------------------------------------------------------

. 
. // Revisar R^2 ajustados (McFadden)
. // Valores típicos en datos microeconómicos: 0.10-0.30 considerados aceptables
. // ssc install fitstat
. fitstat

Measures of Fit for logit of op2021_original

Log-Lik Intercept Only:  -919800.612     Log-Lik Full Model:      -877190.139
D(1327931):              1754380.278     LR(19):                    85220.946
                                         Prob > LR:                     0.000
McFadden's R2:                 0.046     McFadden's Adj R2:             0.046
Maximum Likelihood R2:         0.062     Cragg & Uhler's R2:            0.083
McKelvey and Zavoina's R2:     0.096     Efron's R2:                    0.062
Variance of y*:                3.639     Variance of error:             3.290
Count R2:                      0.591     Adj Count R2:                  0.155
AIC:                           1.321     AIC*n:                   1754430.278
BIC:                      -1.697e+07     BIC':                     -84953.062

. 
. // Distribución sectorial de la muestra
. tab sector

     Sector |
  Económico |      Freq.     Percent        Cum.
------------+-----------------------------------
  Comercial |    884,495       64.49       64.49
 Productivo |    110,597        8.06       72.55
  Servicios |    376,520       27.45      100.00
------------+-----------------------------------
      Total |  1,371,612      100.00

. 
. estimates store modelo_principal

. 
. // Odds ratios para interpretación alternativa
. logit, or

Logistic regression                                  Number of obs = 1,327,956
                                                     Wald chi2(19) =   1581.95
                                                     Prob > chi2   =    0.0000
Log pseudolikelihood = -877190.14                    Pseudo R2     =    0.0463

                                                       (Std. err. adjusted for 335 clusters in ciiu_4dig)
---------------------------------------------------------------------------------------------------------
                                        |               Robust
                        op2021_original | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
----------------------------------------+----------------------------------------------------------------
                                    ruc |    .805665   .0645767    -2.70   0.007      .688538    .9427165
                                        |
                                 region |
                                Sierra  |   .6549594   .0389123    -7.12   0.000     .5829657     .735844
                                 Selva  |     .87417   .0346327    -3.39   0.001     .8088597    .9447538
                                        |
                           region#c.ruc |
                                Sierra  |   1.299842   .0966691     3.53   0.000     1.123536    1.503815
                                 Selva  |   .9874919   .0620431    -0.20   0.841     .8730788    1.116898
                                        |
                             ventas_std |   1.156617   .0257503     6.54   0.000     1.107232    1.208204
                                        |
                                 sector |
                            Productivo  |    .958208   .0991678    -0.41   0.680     .7822876    1.173689
                             Servicios  |   .9520125   .0771087    -0.61   0.544     .8122676    1.115799
                                        |
                           sexo_gerente |   1.032669   .0344047     0.96   0.335     .9673916    1.102352
                        productividad_k |   1.013215   .0020217     6.58   0.000     1.009261    1.017185
                          digital_score |   .8949857   .0210546    -4.72   0.000     .8546564    .9372181
                             tributos_k |   .9998175   .0002759    -0.66   0.508      .999277    1.000358
                             salarios_k |   1.000054    .000067     0.81   0.417     .9999231    1.000186
                                        |
                             tipo_local |
                             Alquilado  |   .6319267   .0430642    -6.74   0.000     .5529164    .7222274
                                  Otro  |   .6544625   .0474237    -5.85   0.000     .5678125    .7543357
                                        |
                                regimen |
Nuevo Régimen Único Simplificado (RUS)  |   1.327111   .0528793     7.10   0.000     1.227413    1.434907
       Régimen Especial de Renta (RER)  |   1.258972   .0810642     3.58   0.000     1.109706    1.428315
         Régimen MYPE Tributario (RMT)  |   1.844644   .1449233     7.79   0.000     1.581388    2.151724
                  Régimen General (RG)  |   3.183316   .5709452     6.46   0.000     2.239814    4.524258
                                        |
                                  _cons |   1.198993    .135796     1.60   0.109     .9603084    1.497001
---------------------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. 
. // Verificar multicolinealidad con VIF usando regresión lineal auxiliar
. // Decisión: VIF<10 incluir ambas ventas-productividad; VIF≥10 priorizar ventas
. quietly regress op2021_original productividad_k tributos_k salarios_k digital_score ventas_std sexo_gerente i.region i.sector 
> i.regimen i.tipo_local

. vif

    Variable |       VIF       1/VIF  
-------------+----------------------
productivi~k |      1.54    0.649982
  tributos_k |      1.18    0.844661
  salarios_k |      1.26    0.791966
digital_sc~e |      1.20    0.836262
  ventas_std |      1.57    0.636190
sexo_gerente |      1.07    0.938462
      region |
          1  |      1.06    0.939990
          2  |      1.06    0.941813
      sector |
          1  |      1.07    0.933698
          2  |      1.15    0.869957
     regimen |
          1  |      1.24    0.808538
          2  |      1.15    0.868857
          3  |      1.24    0.805999
          4  |      1.37    0.731286
  tipo_local |
          1  |      1.09    0.916702
          2  |      1.03    0.974978
-------------+----------------------
    Mean VIF |      1.20

. 
end of do-file

. cls

. do "/var/folders/zq/3f506wxj6djb98qwd23px8lh0000gn/T//SD46295.000000"

. /*-----------------------------------------------------------------------------
> 2.3 ESPECIFICACIONES ALTERNATIVAS: ROBUSTEZ A ENDOGENEIDAD
> 
> Objetivo: Verificar si coeficientes RUC×Región son estables cuando se excluyen
> variables potencialmente endógenas o se restringe la muestra.
> 
> Estrategia:
> 1. Excluir tributos/salarios (post-tratamiento, solo observables en formales)
> 2. Solo controles exógenos (región, sector, sexo, tipo_local)
> 3. Solo microempresas (ventas <S/50k) para reducir heterogeneidad no observada
> 4. Solo pequeñas empresas (ventas ≥S/50k) para comparar efectos
> 
> Interpretación:
> - Coeficientes estables → Resultados robustos a sesgo de variable omitida
> - Coeficientes cambian sustancialmente → Sensibilidad a especificación alta
> -----------------------------------------------------------------------------*/
. 
. display ""


. display "═══════════════════════════════════════════════════════════════"
═══════════════════════════════════════════════════════════════

. display "ESPECIFICACIONES ALTERNATIVAS: EVALUACIÓN DE ROBUSTEZ"
ESPECIFICACIONES ALTERNATIVAS: EVALUACIÓN DE ROBUSTEZ

. display "═══════════════════════════════════════════════════════════════"
═══════════════════════════════════════════════════════════════

. display ""


. 
. // Modelo base (ya estimado arriba)
. display "Modelo base completo ya estimado y almacenado."
Modelo base completo ya estimado y almacenado.

. display ""


. 
. /*--- Especificación 1: Sin tributos ni salarios ---*/
. 
. display "──────────────────────────────────────────────────────────────"
──────────────────────────────────────────────────────────────

. display "Especificación 1: Excluyendo tributos y salarios"
Especificación 1: Excluyendo tributos y salarios

. display "Justificación: Tributos/salarios son POST-TRATAMIENTO (endógenos)"
Justificación: Tributos/salarios son POST-TRATAMIENTO (endógenos)

. display "──────────────────────────────────────────────────────────────"
──────────────────────────────────────────────────────────────

. 
. logit op2021_original c.ruc##(i.region) ventas_std i.sector sexo_gerente productividad_k digital_score i.tipo_local, vce(clust
> er ciiu_4dig)

Iteration 0:  Log pseudolikelihood = -919800.61  
Iteration 1:  Log pseudolikelihood = -886967.96  
Iteration 2:  Log pseudolikelihood = -886149.17  
Iteration 3:  Log pseudolikelihood = -886127.16  
Iteration 4:  Log pseudolikelihood = -886127.09  

Logistic regression                                  Number of obs = 1,327,956
                                                     Wald chi2(13) =    966.32
                                                     Prob > chi2   =    0.0000
Log pseudolikelihood = -886127.09                    Pseudo R2     =    0.0366

                               (Std. err. adjusted for 335 clusters in ciiu_4dig)
---------------------------------------------------------------------------------
                |               Robust
op2021_original | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
            ruc |   .1235174   .0833618     1.48   0.138    -.0398686    .2869035
                |
         region |
        Sierra  |  -.4172473   .0599904    -6.96   0.000    -.5348263   -.2996684
         Selva  |  -.1334901   .0403704    -3.31   0.001    -.2126146   -.0543656
                |
   region#c.ruc |
        Sierra  |   .2610986   .0829308     3.15   0.002     .0985573    .4236399
         Selva  |  -.0683622   .0669845    -1.02   0.307    -.1996493     .062925
                |
     ventas_std |   .2416659   .0251847     9.60   0.000     .1923047     .291027
                |
         sector |
    Productivo  |   .0355944   .0965796     0.37   0.712     -.153698    .2248869
     Servicios  |   .0352901   .0855369     0.41   0.680    -.1323593    .2029394
                |
   sexo_gerente |   .0776108   .0475705     1.63   0.103    -.0156256    .1708473
productividad_k |   .0144906   .0020997     6.90   0.000     .0103752    .0186059
  digital_score |  -.0717013   .0245291    -2.92   0.003    -.1197775   -.0236251
                |
     tipo_local |
     Alquilado  |  -.4948971    .080854    -6.12   0.000     -.653368   -.3364262
          Otro  |  -.4709481   .0850412    -5.54   0.000    -.6376257   -.3042705
                |
          _cons |   .1637634   .1156313     1.42   0.157    -.0628699    .3903967
---------------------------------------------------------------------------------

. estimates store sin_tributos_salarios

. 
. display "Especificación 1 completada."
Especificación 1 completada.

. display ""


. 
. /*--- Especificación 2: Solo controles exógenos ---*/
. 
. display "──────────────────────────────────────────────────────────────"
──────────────────────────────────────────────────────────────

. display "Especificación 2: Solo controles estrictamente exógenos"
Especificación 2: Solo controles estrictamente exógenos

. display "Variables incluidas: región, sector, sexo gerente, tipo local"
Variables incluidas: región, sector, sexo gerente, tipo local

. display "Excluidas: ventas, productividad, digital, tributos, salarios, régimen"
Excluidas: ventas, productividad, digital, tributos, salarios, régimen

. display "──────────────────────────────────────────────────────────────"
──────────────────────────────────────────────────────────────

. 
. logit op2021_original c.ruc##(i.region) i.sector sexo_gerente i.tipo_local, vce(cluster ciiu_4dig)

Iteration 0:  Log pseudolikelihood =  -948621.4  
Iteration 1:  Log pseudolikelihood = -926596.95  
Iteration 2:  Log pseudolikelihood = -926583.44  
Iteration 3:  Log pseudolikelihood = -926583.44  

Logistic regression                                  Number of obs = 1,371,481
                                                     Wald chi2(10) =    605.42
                                                     Prob > chi2   =    0.0000
Log pseudolikelihood = -926583.44                    Pseudo R2     =    0.0232

                               (Std. err. adjusted for 356 clusters in ciiu_4dig)
---------------------------------------------------------------------------------
                |               Robust
op2021_original | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
            ruc |   .2677354   .0916802     2.92   0.003     .0880455    .4474253
                |
         region |
        Sierra  |  -.4366902   .0635192    -6.87   0.000    -.5611856   -.3121948
         Selva  |  -.1228793   .0430101    -2.86   0.004    -.2071776    -.038581
                |
   region#c.ruc |
        Sierra  |   .2565404   .0834848     3.07   0.002     .0929132    .4201676
         Selva  |   -.027433   .0666092    -0.41   0.680    -.1579846    .1031187
                |
         sector |
    Productivo  |   .1147562   .1082246     1.06   0.289    -.0973602    .3268726
     Servicios  |   .1554875   .1163754     1.34   0.182    -.0726041    .3835791
                |
   sexo_gerente |   .1167742   .0499054     2.34   0.019     .0189615    .2145868
                |
     tipo_local |
     Alquilado  |    -.54199   .1057211    -5.13   0.000    -.7491995   -.3347805
          Otro  |  -.5472245   .1009591    -5.42   0.000    -.7451007   -.3493483
                |
          _cons |   .1892346   .1327809     1.43   0.154    -.0710113    .4494804
---------------------------------------------------------------------------------

. estimates store solo_exogenos

. 
. display "Especificación 2 completada."
Especificación 2 completada.

. display ""


. 
. /*--- Especificación 3: Solo microempresas ---*/
. 
. display "──────────────────────────────────────────────────────────────"
──────────────────────────────────────────────────────────────

. display "Especificación 3: Solo microempresas (ventas <S/50,000)"
Especificación 3: Solo microempresas (ventas <S/50,000)

. display "Justificación: Muestra más homogénea reduce sesgo de selección"
Justificación: Muestra más homogénea reduce sesgo de selección

. display "──────────────────────────────────────────────────────────────"
──────────────────────────────────────────────────────────────

. 
. preserve

. keep if ventas_soles_2021 < 50000 & !missing(ventas_soles_2021)
(358,298 observations deleted)

. display "Observaciones en submuestra: " _N
Observaciones en submuestra: 1019633

. 
. // Re-estandarizar ventas en submuestra
. quietly summarize ventas_soles_2021

. gen ventas_std_micro = (ventas_soles_2021 - r(mean)) / r(sd)

. 
. logit op2021_original c.ruc##(i.region) ventas_std_micro i.sector sexo_gerente productividad_k digital_score i.tipo_local, vce
> (cluster ciiu_4dig)

Iteration 0:  Log pseudolikelihood = -680214.89  
Iteration 1:  Log pseudolikelihood = -653784.56  
Iteration 2:  Log pseudolikelihood = -653735.55  
Iteration 3:  Log pseudolikelihood = -653735.55  

Logistic regression                                    Number of obs = 985,239
                                                       Wald chi2(13) = 1236.00
                                                       Prob > chi2   =  0.0000
Log pseudolikelihood = -653735.55                      Pseudo R2     =  0.0389

                                (Std. err. adjusted for 329 clusters in ciiu_4dig)
----------------------------------------------------------------------------------
                 |               Robust
 op2021_original | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-----------------+----------------------------------------------------------------
             ruc |   .0428479    .062642     0.68   0.494    -.0799281    .1656239
                 |
          region |
         Sierra  |  -.3627954   .0539715    -6.72   0.000    -.4685775   -.2570133
          Selva  |  -.1955954   .0466323    -4.19   0.000    -.2869929   -.1041978
                 |
    region#c.ruc |
         Sierra  |   .2225747   .0904242     2.46   0.014     .0453465    .3998029
          Selva  |  -.0464057   .0639087    -0.73   0.468    -.1716643     .078853
                 |
ventas_std_micro |   .3366279   .0241991    13.91   0.000     .2891985    .3840572
                 |
          sector |
     Productivo  |   .0449254   .0867002     0.52   0.604    -.1250039    .2148546
      Servicios  |   .0563695   .0760051     0.74   0.458    -.0925978    .2053368
                 |
    sexo_gerente |   .0629355   .0590618     1.07   0.287    -.0528235    .1786944
 productividad_k |   .0059016   .0057958     1.02   0.309     -.005458    .0172612
   digital_score |  -.1046088   .0324253    -3.23   0.001    -.1681612   -.0410565
                 |
      tipo_local |
      Alquilado  |   -.545109   .0777287    -7.01   0.000    -.6974544   -.3927637
           Otro  |  -.4718543   .0817115    -5.77   0.000    -.6320059   -.3117027
                 |
           _cons |   .1041808   .0804645     1.29   0.195    -.0535267    .2618883
----------------------------------------------------------------------------------

. estimates store solo_micro

. restore

. 
. display "Especificación 3 completada."
Especificación 3 completada.

. display ""


. 
. /*--- Especificación 4: Solo pequeñas empresas ---*/
. 
. display "──────────────────────────────────────────────────────────────"
──────────────────────────────────────────────────────────────

. display "Especificación 4: Solo pequeñas empresas (ventas ≥S/50,000)"
Especificación 4: Solo pequeñas empresas (ventas ≥S/50,000)

. display "Justificación: Comparar con microempresas para heterogeneidad por tamaño"
Justificación: Comparar con microempresas para heterogeneidad por tamaño

. display "──────────────────────────────────────────────────────────────"
──────────────────────────────────────────────────────────────

. 
. preserve

. keep if ventas_soles_2021 >= 50000 & !missing(ventas_soles_2021)
(1,019,633 observations deleted)

. display "Observaciones en submuestra: " _N
Observaciones en submuestra: 358298

. 
. // Re-estandarizar ventas en submuestra
. quietly summarize ventas_soles_2021

. gen ventas_std_pequena = (ventas_soles_2021 - r(mean)) / r(sd)

. 
. logit op2021_original c.ruc##(i.region) ventas_std_pequena i.sector sexo_gerente productividad_k digital_score i.tipo_local, v
> ce(cluster ciiu_4dig)

Iteration 0:  Log pseudolikelihood = -217863.82  
Iteration 1:  Log pseudolikelihood = -211025.39  
Iteration 2:  Log pseudolikelihood =  -210758.6  
Iteration 3:  Log pseudolikelihood = -210756.84  
Iteration 4:  Log pseudolikelihood = -210756.84  

Logistic regression                                    Number of obs = 342,717
                                                       Wald chi2(13) = 1373.68
                                                       Prob > chi2   =  0.0000
Log pseudolikelihood = -210756.84                      Pseudo R2     =  0.0326

                                  (Std. err. adjusted for 333 clusters in ciiu_4dig)
------------------------------------------------------------------------------------
                   |               Robust
   op2021_original | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------------+----------------------------------------------------------------
               ruc |  -.3695318   .1191627    -3.10   0.002    -.6030863   -.1359772
                   |
            region |
           Sierra  |  -.3809329   .0674806    -5.65   0.000    -.5131925   -.2486733
            Selva  |   .0035215   .0807147     0.04   0.965    -.1546763    .1617193
                   |
      region#c.ruc |
           Sierra  |   .3236091    .119544     2.71   0.007     .0893072     .557911
            Selva  |  -.2643119   .1039236    -2.54   0.011    -.4679983   -.0606254
                   |
ventas_std_pequena |    .392342   .0322051    12.18   0.000      .329221    .4554629
                   |
            sector |
       Productivo  |  -.0377757   .1457918    -0.26   0.796    -.3235223    .2479709
        Servicios  |   .0655734   .1591817     0.41   0.680     -.246417    .3775639
                   |
      sexo_gerente |   .0025888   .0506562     0.05   0.959    -.0966955    .1018732
   productividad_k |   .0018755   .0007259     2.58   0.010     .0004528    .0032981
     digital_score |  -.0751891   .0312515    -2.41   0.016    -.1364409   -.0139374
                   |
        tipo_local |
        Alquilado  |    -.57116   .0802511    -7.12   0.000    -.7284491   -.4138708
             Otro  |  -.3581461   .0805086    -4.45   0.000    -.5159402   -.2003521
                   |
             _cons |   1.418261   .1215503    11.67   0.000     1.180026    1.656495
------------------------------------------------------------------------------------

. estimates store solo_pequena

. restore

. 
. display "Especificación 4 completada."
Especificación 4 completada.

. display ""


. 
. /*--- Comparación de resultados ---*/
. 
. display "══════════════════════════════════════════════════════════════"
══════════════════════════════════════════════════════════════

. display "COMPARACIÓN DE COEFICIENTES RUC×REGIÓN"
COMPARACIÓN DE COEFICIENTES RUC×REGIÓN

. display "══════════════════════════════════════════════════════════════"
══════════════════════════════════════════════════════════════

. display ""


. 
. esttab modelo_principal sin_tributos_salarios solo_exogenos solo_micro solo_pequena, ///
>     keep(ruc 1.region#c.ruc 2.region#c.ruc) ///
>     se star(* 0.10 ** 0.05 *** 0.01) b(%9.4f) ///
>     mtitles("Completo" "Sin trib/sal" "Solo exóg" "Micro<50k" "Peq≥50k") ///
>     stats(N ll, fmt(%9.0fc %9.1f) labels("Observaciones" "Log-likelihood")) ///
>     title("Robustez de efectos RUC×Región a especificación alternativa")

Robustez de efectos RUC×Región a especificación alternativa
--------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)   
                 Completo    Sin trib/sal       Solo exóg       Micro<50k         Peq≥50k   
--------------------------------------------------------------------------------------------
op2021_ori~l                                                                                
ruc               -0.2161***       0.1235          0.2677***       0.0428         -0.3695***
                 (0.0802)        (0.0834)        (0.0917)        (0.0626)        (0.1192)   

1.region#c~c       0.2622***       0.2611***       0.2565***       0.2226**        0.3236***
                 (0.0744)        (0.0829)        (0.0835)        (0.0904)        (0.1195)   

2.region#c~c      -0.0126         -0.0684         -0.0274         -0.0464         -0.2643** 
                 (0.0628)        (0.0670)        (0.0666)        (0.0639)        (0.1039)   
--------------------------------------------------------------------------------------------
Observacio~s    1,327,956       1,327,956       1,371,481         985,239         342,717   
Log-likeli~d    -877190.1       -886127.1       -926583.4       -653735.5       -210756.8   
--------------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. 
. display ""


. display "══════════════════════════════════════════════════════════════"
══════════════════════════════════════════════════════════════

. display "INTERPRETACIÓN:"
INTERPRETACIÓN:

. display "══════════════════════════════════════════════════════════════"
══════════════════════════════════════════════════════════════

. display "1. Coeficientes estables entre especificaciones 1-2 → Robustez a"
1. Coeficientes estables entre especificaciones 1-2 → Robustez a

. display "   inclusión de variables potencialmente endógenas"
   inclusión de variables potencialmente endógenas

. display ""


. display "2. Diferencias entre Micro/Pequeña → Heterogeneidad por tamaño:"
2. Diferencias entre Micro/Pequeña → Heterogeneidad por tamaño:

. display "   - Si efectos más negativos en micro: Costos formalización"
   - Si efectos más negativos en micro: Costos formalización

. display "     insostenibles en empresas pequeñas"
     insostenibles en empresas pequeñas

. display "   - Si efectos más positivos en pequeña: Beneficios formalización"
   - Si efectos más positivos en pequeña: Beneficios formalización

. display "     (acceso crédito/contratos) requieren escala mínima"
     (acceso crédito/contratos) requieren escala mínima

. display ""


. display "3. Comparar significancia estadística: ¿Se mantienen * en todas?"
3. Comparar significancia estadística: ¿Se mantienen * en todas?

. display "   - Sí → Resultados robustos a especificación"
   - Sí → Resultados robustos a especificación

. display "   - No → Advertencia sobre sensibilidad a controles incluidos"
   - No → Advertencia sobre sensibilidad a controles incluidos

. display "══════════════════════════════════════════════════════════════"
══════════════════════════════════════════════════════════════

. display ""


. 
. // Restaurar el modelo logístico principal para efectos marginales
. estimates restore modelo_principal
(results modelo_principal are active now)

. 
end of do-file

. cls

. do "/var/folders/zq/3f506wxj6djb98qwd23px8lh0000gn/T//SD46295.000000"

. /*=============================================================================
> 4. EFECTOS MARGINALES POR REGIÓN
> =============================================================================*/
. 
. // Efectos marginales promedio de RUC por región
. // Interpretación: Cambio en probabilidad de supervivencia (puntos porcentuales)
. // asociado a formalización (tener RUC) en cada región
. margins region, dydx(ruc)

Average marginal effects                             Number of obs = 1,327,956
Model VCE: Robust

Expression: Pr(op2021_original), predict()
dy/dx wrt:  ruc

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
ruc          |
      region |
      Costa  |  -.0509367   .0188255    -2.71   0.007    -.0878339   -.0140394
     Sierra  |   .0107841   .0088621     1.22   0.224    -.0065853    .0281535
      Selva  |  -.0540898   .0224143    -2.41   0.016    -.0980211   -.0101586
------------------------------------------------------------------------------

. 
. // Visualización de efectos marginales por región
. marginsplot, ///
>     title("Efecto de la formalización en supervivencia empresarial por región", size(medium)) ///
>     ytitle("Efecto marginal de RUC" "Δ Pr(Supervivencia)", size(small)) ///
>     xlabel(0 "Costa" 1 "Sierra" 2 "Selva", noticks) ///
>     note("Efectos marginales promedio del modelo logístico con interacciones RUC×Región") ///
>     name(me_region, replace)

Variables that uniquely identify margins: region

. 
. // Tests de hipótesis sobre heterogeneidad regional
. display ""


. display "═══════════════════════════════════════════════════════════════"
═══════════════════════════════════════════════════════════════

. display "TESTS DE HETEROGENEIDAD REGIONAL"
TESTS DE HETEROGENEIDAD REGIONAL

. display "═══════════════════════════════════════════════════════════════"
═══════════════════════════════════════════════════════════════

. 
. // Test 1: Efecto conjunto de interacciones regionales
. display ""


. display "Test 1: ¿Hay heterogeneidad regional en el efecto de RUC?"
Test 1: ¿Hay heterogeneidad regional en el efecto de RUC?

. display "H0: Efecto de RUC es igual en todas las regiones (β₄=β₅=0)"
H0: Efecto de RUC es igual en todas las regiones (β₄=β₅=0)

. test 1.region#c.ruc 2.region#c.ruc

 ( 1)  [op2021_original]1.region#c.ruc = 0
 ( 2)  [op2021_original]2.region#c.ruc = 0

           chi2(  2) =   12.81
         Prob > chi2 =    0.0016

. 
. // Test 2: Sierra vs Costa
. display ""


. display "Test 2: ¿El efecto de RUC en Sierra difiere de Costa?"
Test 2: ¿El efecto de RUC en Sierra difiere de Costa?

. display "H0: Efecto RUC en Sierra = Efecto RUC en Costa (β₄=0)"
H0: Efecto RUC en Sierra = Efecto RUC en Costa (β₄=0)

. test 1.region#c.ruc = 0

 ( 1)  [op2021_original]1.region#c.ruc = 0

           chi2(  1) =   12.43
         Prob > chi2 =    0.0004

. 
. // Test 3: Selva vs Costa
. display ""


. display "Test 3: ¿El efecto de RUC en Selva difiere de Costa?"
Test 3: ¿El efecto de RUC en Selva difiere de Costa?

. display "H0: Efecto RUC en Selva = Efecto RUC en Costa (β₅=0)"
H0: Efecto RUC en Selva = Efecto RUC en Costa (β₅=0)

. test 2.region#c.ruc = 0

 ( 1)  [op2021_original]2.region#c.ruc = 0

           chi2(  1) =    0.04
         Prob > chi2 =    0.8412

. 
. // Test 4: Sierra vs Selva
. display ""


. display "Test 4: ¿El efecto de RUC en Sierra difiere de Selva?"
Test 4: ¿El efecto de RUC en Sierra difiere de Selva?

. display "H0: Efecto RUC en Sierra = Efecto RUC en Selva (β₄=β₅)"
H0: Efecto RUC en Sierra = Efecto RUC en Selva (β₄=β₅)

. test 1.region#c.ruc = 2.region#c.ruc

 ( 1)  [op2021_original]1.region#c.ruc - [op2021_original]2.region#c.ruc = 0

           chi2(  1) =    9.01
         Prob > chi2 =    0.0027

. 
. display "═══════════════════════════════════════════════════════════════"
═══════════════════════════════════════════════════════════════

. display ""


. 
. /*=============================================================================
> 5. EFECTOS MARGINALES POR VENTAS
> =============================================================================*/
. 
. // Efectos marginales de RUC condicionales a escala empresarial (ventas estandarizadas)
. // Objetivo: Explorar heterogeneidad del efecto de formalización según tamaño económico
. // Interpretación: ¿El beneficio de formalización varía según escala de ventas?
. 
. // Obtener estadísticas de ventas estandarizadas
. quietly summarize ventas_std, detail

. local p10 = r(p10)

. local p25 = r(p25)

. local p50 = r(p50)

. local p75 = r(p75)

. local p90 = r(p90)

. 
. display "Distribución de ventas estandarizadas (percentiles):"
Distribución de ventas estandarizadas (percentiles):

. display "  P10: " %6.2f `p10' " | P25: " %6.2f `p25' " | P50: " %6.2f `p50'
  P10:  -0.22 | P25:  -0.22 | P50:  -0.20

. display "  P75: " %6.2f `p75' " | P90: " %6.2f `p90'
  P75:  -0.15 | P90:   0.05

. display ""


. 
. // Calcular efectos marginales de RUC en diferentes niveles de ventas
. // Usar rango amplio para capturar microempresas (P10) hasta pequeñas empresas (P90)
. margins region, dydx(ruc) at(ventas_std = (-2(0.5)3))

Average marginal effects                             Number of obs = 1,327,956
Model VCE: Robust

Expression: Pr(op2021_original), predict()
dy/dx wrt:  ruc
1._at:  ventas_std =   -2
2._at:  ventas_std = -1.5
3._at:  ventas_std =   -1
4._at:  ventas_std =  -.5
5._at:  ventas_std =    0
6._at:  ventas_std =   .5
7._at:  ventas_std =    1
8._at:  ventas_std =  1.5
9._at:  ventas_std =    2
10._at: ventas_std =  2.5
11._at: ventas_std =    3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
ruc          |
  _at#region |
    1#Costa  |  -.0512123   .0190565    -2.69   0.007    -.0885623   -.0138624
   1#Sierra  |   .0105303   .0086681     1.21   0.224    -.0064589    .0275196
    1#Selva  |  -.0534858   .0223828    -2.39   0.017    -.0973554   -.0096163
    2#Costa  |  -.0513882   .0190769    -2.69   0.007    -.0887782   -.0139981
   2#Sierra  |   .0106501   .0087606     1.22   0.224    -.0065203    .0278205
    2#Selva  |  -.0539121   .0224861    -2.40   0.017    -.0979841   -.0098402
    3#Costa  |  -.0514445   .0190583    -2.70   0.007    -.0887981   -.0140909
   3#Sierra  |   .0107475   .0088359     1.22   0.224    -.0065705    .0280656
    3#Selva  |  -.0542172   .0225458    -2.40   0.016    -.0984061   -.0100283
    4#Costa  |  -.0513805   .0190007    -2.70   0.007    -.0886211   -.0141398
   4#Sierra  |   .0108217   .0088934     1.22   0.224     -.006609    .0282524
    4#Selva  |  -.0543978   .0225611    -2.41   0.016    -.0986168   -.0101789
    5#Costa  |  -.0511961   .0189045    -2.71   0.007    -.0882482    -.014144
   5#Sierra  |   .0108719   .0089325     1.22   0.224    -.0066355    .0283792
    5#Selva  |   -.054452    .022532    -2.42   0.016    -.0986139     -.01029
    6#Costa  |  -.0508927   .0187708    -2.71   0.007    -.0876828   -.0141026
   6#Sierra  |   .0108974   .0089528     1.22   0.224    -.0066497    .0284445
    6#Selva  |  -.0543785   .0224588    -2.42   0.015     -.098397   -.0103601
    7#Costa  |  -.0504725   .0186012    -2.71   0.007    -.0869302   -.0140148
   7#Sierra  |   .0108981    .008954     1.22   0.224    -.0066514    .0284475
    7#Selva  |  -.0541778   .0223424    -2.42   0.015    -.0979681   -.0103875
    8#Costa  |  -.0499389   .0183976    -2.71   0.007    -.0859975   -.0138802
   8#Sierra  |   .0108737    .008936     1.22   0.224    -.0066406     .028388
    8#Selva  |   -.053851   .0221843    -2.43   0.015    -.0973314   -.0103707
    9#Costa  |  -.0492962   .0181624    -2.71   0.007    -.0848939   -.0136985
   9#Sierra  |   .0108243    .008899     1.22   0.224    -.0066175    .0282661
    9#Selva  |  -.0534008   .0219862    -2.43   0.015     -.096493   -.0103085
   10#Costa  |  -.0485497   .0178983    -2.71   0.007    -.0836297   -.0134698
  10#Sierra  |   .0107504   .0088433     1.22   0.224    -.0065822    .0280829
   10#Selva  |  -.0528306   .0217507    -2.43   0.015    -.0954612   -.0102001
   11#Costa  |  -.0477056   .0176081    -2.71   0.007    -.0822169   -.0131943
  11#Sierra  |   .0106523   .0087692     1.21   0.224     -.006535    .0278397
   11#Selva  |  -.0521453   .0214802    -2.43   0.015    -.0942457   -.0100449
------------------------------------------------------------------------------

. 
. // Visualización: Efecto de RUC según escala de ventas por región
. marginsplot, ///
>     title("Efecto de formalización según escala de ventas", size(medium)) ///
>     subtitle("Por región geográfica", size(small)) ///
>     ytitle("Efecto marginal de RUC" "Δ Pr(Supervivencia)", size(small)) ///
>     xtitle("Ventas estandarizadas (σ)", size(small)) ///
>     xlabel(-2(0.5)3, format(%3.1f)) ///
>     xline(0, lpattern(dash) lcolor(gs10)) ///
>     note("Ventas estandarizadas: 0 = media muestral, ±1 = ±1 desviación estándar" ///
>          "P10≈-1.5σ (microempresas pequeñas), P50≈-0.3σ (mediana), P90≈1.2σ (pequeñas empresas grandes)") ///
>     legend(cols(3) size(small)) ///
>     name(me_ventas_region, replace)

Variables that uniquely identify margins: ventas_std region

. 
. // Interpretación guiada para el paper
. display "═══════════════════════════════════════════════════════════════"
═══════════════════════════════════════════════════════════════

. display "INTERPRETACIÓN: EFECTOS MARGINALES POR ESCALA DE VENTAS"
INTERPRETACIÓN: EFECTOS MARGINALES POR ESCALA DE VENTAS

. display "═══════════════════════════════════════════════════════════════"
═══════════════════════════════════════════════════════════════

. display "- Si líneas son horizontales: Efecto de RUC constante (no varía con ventas)"
- Si líneas son horizontales: Efecto de RUC constante (no varía con ventas)

. display "- Si líneas crecen: Mayor beneficio de formalización en empresas grandes"
- Si líneas crecen: Mayor beneficio de formalización en empresas grandes

. display "- Si líneas decrecen: Mayor beneficio de formalización en microempresas"
- Si líneas decrecen: Mayor beneficio de formalización en microempresas

. display "- Diferencias entre regiones: Heterogeneidad espacial del efecto"
- Diferencias entre regiones: Heterogeneidad espacial del efecto

. display "═══════════════════════════════════════════════════════════════"
═══════════════════════════════════════════════════════════════

. display ""


. 
. 
. 
. /*=============================================================================
> 6. PROBABILIDADES PREDICHAS POR PRODUCTIVIDAD
> =============================================================================*/
. 
. // NOTA METODOLÓGICA:
. // No calculamos efectos marginales de RUC condicionales a productividad porque
. // el modelo NO incluye interacción RUC×productividad (solo RUC×Región).
. // Sin esa interacción, el efecto de RUC no varía verdaderamente con productividad.
. //
. // En su lugar, calculamos PROBABILIDADES PREDICHAS de supervivencia por región
. // en diferentes niveles de productividad, mostrando cómo la productividad afecta
. // el outcome directamente (no el efecto de RUC).
. 
. // Obtener estadísticas de productividad
. quietly summarize productividad_k, detail

. local p10 = r(p10)

. local p25 = r(p25)

. local p50 = r(p50)

. local p75 = r(p75)

. local p90 = r(p90)

. local max = r(max)

. 
. display "Distribución de productividad laboral (miles de soles/trabajador):"
Distribución de productividad laboral (miles de soles/trabajador):

. display "  P10: " %6.2f `p10' "k | P25: " %6.2f `p25' "k | P50: " %6.2f `p50' "k"
  P10:   1.37k | P25:   2.57k | P50:   5.33k

. display "  P75: " %6.2f `p75' "k | P90: " %6.2f `p90' "k | Max: " %6.2f `max' "k"
  P75:  11.57k | P90:  25.13k | Max: 126.22k

. display ""


. 
. // Calcular probabilidades predichas de supervivencia por región
. // en diferentes niveles de productividad (0 a 120 en incrementos de 10)
. margins region, at(productividad_k = (0(10)120))

Predictive margins                                   Number of obs = 1,327,956
Model VCE: Robust

Expression: Pr(op2021_original), predict()
1._at:  productividad_k =   0
2._at:  productividad_k =  10
3._at:  productividad_k =  20
4._at:  productividad_k =  30
5._at:  productividad_k =  40
6._at:  productividad_k =  50
7._at:  productividad_k =  60
8._at:  productividad_k =  70
9._at:  productividad_k =  80
10._at: productividad_k =  90
11._at: productividad_k = 100
12._at: productividad_k = 110
13._at: productividad_k = 120

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
  _at#region |
    1#Costa  |   .5074066   .0117585    43.15   0.000     .4843604    .5304528
   1#Sierra  |   .4473357   .0093437    47.88   0.000     .4290223    .4656491
    1#Selva  |   .4731487   .0139226    33.98   0.000     .4458609    .5004364
    2#Costa  |   .5389142   .0116949    46.08   0.000     .5159926    .5618357
   2#Sierra  |   .4784464   .0099212    48.22   0.000     .4590013    .4978916
    2#Selva  |    .504674    .013847    36.45   0.000     .4775344    .5318135
    3#Costa  |   .5701555   .0133897    42.58   0.000     .5439121    .5963989
   3#Sierra  |   .5097631   .0124842    40.83   0.000     .4852945    .5342318
    3#Selva  |   .5361976   .0152989    35.05   0.000     .5062124    .5661828
    4#Costa  |   .6008934   .0161404    37.23   0.000     .5692588     .632528
   4#Sierra  |   .5410481   .0160539    33.70   0.000      .509583    .5725132
    4#Selva  |   .5674754   .0178244    31.84   0.000     .5325403    .6024106
    5#Costa  |   .6309048   .0192821    32.72   0.000     .5931125     .668697
   5#Sierra  |   .5720632   .0199506    28.67   0.000     .5329608    .6111656
    5#Selva  |   .5982693    .020874    28.66   0.000      .557357    .6391816
    6#Costa  |   .6599863    .022411    29.45   0.000     .6160615     .703911
   6#Sierra  |   .6025769   .0238152    25.30   0.000        .5559    .6492539
    6#Selva  |   .6283546   .0240432    26.13   0.000     .5812308    .6754784
    7#Costa  |   .6879597   .0252994    27.19   0.000     .6383738    .7375456
   7#Sierra  |   .6323709   .0274419    23.04   0.000     .5785857    .6861561
    7#Selva  |    .657526   .0270721    24.29   0.000     .6044657    .7105864
    8#Costa  |   .7146756   .0278176    25.69   0.000     .6601541    .7691971
   8#Sierra  |    .661246   .0306995    21.54   0.000     .6010761     .721416
    8#Selva  |   .6856031   .0297972    23.01   0.000     .6272018    .7440045
    9#Costa  |   .7400154    .029894    24.75   0.000     .6814243    .7986065
   9#Sierra  |   .6890274    .033502    20.57   0.000     .6233647    .7546902
    9#Selva  |   .7124339   .0321174    22.18   0.000     .6494849    .7753829
   10#Costa  |   .7638923   .0314955    24.25   0.000     .7021621    .8256224
  10#Sierra  |   .7155679   .0357967    19.99   0.000     .6454077    .7857282
   10#Selva  |   .7378971   .0339756    21.72   0.000     .6713061     .804488
   11#Costa  |   .7862501   .0326174    24.11   0.000     .7223211    .8501791
  11#Sierra  |   .7407503   .0375579    19.72   0.000     .6671381    .8143626
   11#Selva  |   .7619031   .0353471    21.55   0.000     .6926241    .8311821
   12#Costa  |   .8070622   .0332755    24.25   0.000     .7418435     .872281
  12#Sierra  |   .7644883   .0387832    19.71   0.000     .6884745    .8405021
   12#Selva  |   .7843935   .0362325    21.65   0.000     .7133792    .8554079
   13#Costa  |   .8263282   .0335009    24.67   0.000     .7606676    .8919888
  13#Sierra  |   .7867257   .0394894    19.92   0.000     .7093279    .8641235
   13#Selva  |   .8053391   .0366519    21.97   0.000     .7335026    .8771756
------------------------------------------------------------------------------

. 
. // Visualización: Probabilidad de supervivencia según productividad por región
. marginsplot, ///
>     title("Probabilidad de supervivencia según productividad laboral", size(medium)) ///
>     subtitle("Por región geográfica", size(small)) ///
>     ytitle("Pr(Operativa en 2021)", size(small)) ///
>     xtitle("Productividad laboral (miles S/. / trabajador)", size(small)) ///
>     xlabel(0(20)120, format(%3.0f)) ///
>     ylabel(, format(%3.2f)) ///
>     note("VAB = Valor Agregado Bruto (Ventas - Consumo Intermedio)" ///
>          "Productividad = VAB / Trabajadores Ocupados (definición oficial INEI 2022)" ///
>          "Curvas muestran probabilidades predichas manteniendo otros controles en su media") ///
>     legend(cols(3) size(small) order(1 "Costa" 2 "Sierra" 3 "Selva")) ///
>     name(prob_productividad, replace)

Variables that uniquely identify margins: productividad_k region

. 
. // Interpretación guiada
. display "═══════════════════════════════════════════════════════════════"
═══════════════════════════════════════════════════════════════

. display "INTERPRETACIÓN: PRODUCTIVIDAD Y SUPERVIVENCIA"
INTERPRETACIÓN: PRODUCTIVIDAD Y SUPERVIVENCIA

. display "═══════════════════════════════════════════════════════════════"
═══════════════════════════════════════════════════════════════

. display "- Curvas crecientes: Mayor productividad aumenta supervivencia"
- Curvas crecientes: Mayor productividad aumenta supervivencia

. display "- Pendiente de curvas: Magnitud del efecto productividad en cada región"
- Pendiente de curvas: Magnitud del efecto productividad en cada región

. display "- Separación vertical: Diferencias regionales en probabilidad base"
- Separación vertical: Diferencias regionales en probabilidad base

. display "- Conexión con Jovanovic (1982): Productividad como proxy de θ (eficiencia)"
- Conexión con Jovanovic (1982): Productividad como proxy de θ (eficiencia)

. display "  → Empresas más eficientes (mayor θ) tienen mayor probabilidad de sobrevivir"
  → Empresas más eficientes (mayor θ) tienen mayor probabilidad de sobrevivir

. display "═══════════════════════════════════════════════════════════════"
═══════════════════════════════════════════════════════════════

. display ""


. 
. 
end of do-file

. cls

. do "/var/folders/zq/3f506wxj6djb98qwd23px8lh0000gn/T//SD46295.000000"

. /*=============================================================================
> 7. ANÁLISIS POR RÉGIMEN TRIBUTARIO
> =============================================================================*/
. 
. // NOTA METODOLÓGICA:
. // El régimen tributario está altamente correlacionado con formalización:
. // - Régimen 0 (Ninguno) = empresas informales (RUC=0)
. // - Regímenes 1-4 (RUS, RER, RMT, RG) = empresas formales (RUC=1)
. //
. // Análisis se enfoca en DOS dimensiones:
. // 1. Probabilidades predichas por régimen (todos los datos)
. // 2. Comparación entre regímenes tributarios (solo formales: RUC=1)
. 
. // Restaurar modelo principal
. estimates restore modelo_principal
(results modelo_principal are active now)

. 
. // Distribución de empresas por régimen tributario
. display "═══════════════════════════════════════════════════════════════"
═══════════════════════════════════════════════════════════════

. display "DISTRIBUCIÓN DE EMPRESAS POR RÉGIMEN TRIBUTARIO"
DISTRIBUCIÓN DE EMPRESAS POR RÉGIMEN TRIBUTARIO

. display "═══════════════════════════════════════════════════════════════"
═══════════════════════════════════════════════════════════════

. tab regimen, missing

                    Régimen Tributario |      Freq.     Percent        Cum.
---------------------------------------+-----------------------------------
                               Ninguno |    550,603       39.96       39.96
Nuevo Régimen Único Simplificado (RUS) |    488,391       35.44       75.40
       Régimen Especial de Renta (RER) |     83,620        6.07       81.47
         Régimen MYPE Tributario (RMT) |     96,882        7.03       88.50
                  Régimen General (RG) |    158,435       11.50      100.00
---------------------------------------+-----------------------------------
                                 Total |  1,377,931      100.00

. 
. // Distribución cruzada: régimen × formalización
. tab regimen ruc, col nofreq

                      |    Tenencia de RUC
                      |     (Formalidad)
   Régimen Tributario | Informal   Formal (c |     Total
----------------------+----------------------+----------
              Ninguno |    100.00      10.36 |     39.96 
Nuevo Régimen Único S |      0.00      52.92 |     35.44 
Régimen Especial de R |      0.00       9.06 |      6.07 
Régimen MYPE Tributar |      0.00      10.50 |      7.03 
 Régimen General (RG) |      0.00      17.17 |     11.50 
----------------------+----------------------+----------
                Total |    100.00     100.00 |    100.00 

. display ""


. 
. /*-----------------------------------------------------------------------------
> 7.1 PROBABILIDADES PREDICHAS POR RÉGIMEN TRIBUTARIO (TODOS)
> -----------------------------------------------------------------------------*/
. 
. // Probabilidades predichas de supervivencia por régimen
. // Interpretación: Pr(Operativa en 2021) promedio en cada régimen tributario
. margins regimen

Predictive margins                                   Number of obs = 1,327,956
Model VCE: Robust

Expression: Pr(op2021_original), predict()

---------------------------------------------------------------------------------------------------------
                                        |            Delta-method
                                        |     Margin   std. err.      z    P>|z|     [95% conf. interval]
----------------------------------------+----------------------------------------------------------------
                                regimen |
                               Ninguno  |    .455739   .0140756    32.38   0.000     .4281514    .4833266
Nuevo Régimen Único Simplificado (RUS)  |   .5237031   .0106588    49.13   0.000     .5028122     .544594
       Régimen Especial de Renta (RER)  |   .5110246   .0112676    45.35   0.000     .4889405    .5331087
         Régimen MYPE Tributario (RMT)  |   .6017298   .0147702    40.74   0.000     .5727807     .630679
                  Régimen General (RG)  |   .7195014   .0316938    22.70   0.000     .6573827      .78162
---------------------------------------------------------------------------------------------------------

. 
. // Visualización
. marginsplot, ///
>     title("Probabilidad de supervivencia por régimen tributario", size(medium)) ///
>     ytitle("Pr(Operativa en 2021)", size(small)) ///
>     xtitle("Régimen tributario", size(small)) ///
>     xlabel(0 "Ninguno" 1 "RUS" 2 "RER" 3 "RMT" 4 "RG", angle(45) labsize(small)) ///
>     ylabel(, format(%3.2f)) ///
>     note("0=Ninguno (informales), 1=RUS, 2=RER, 3=RMT, 4=RG" ///
>          "Régimen 0 incluye empresas informales (sin RUC)" ///
>          "Regímenes 1-4 son solo empresas formales") ///
>     name(prob_regimen_all, replace)

Variables that uniquely identify margins: regimen

. 
. // Test de diferencias entre regímenes
. display "Test de Wald: ¿Difieren las probabilidades entre regímenes?"
Test de Wald: ¿Difieren las probabilidades entre regímenes?

. test 1.regimen 2.regimen 3.regimen 4.regimen

 ( 1)  [op2021_original]1.regimen = 0
 ( 2)  [op2021_original]2.regimen = 0
 ( 3)  [op2021_original]3.regimen = 0
 ( 4)  [op2021_original]4.regimen = 0

           chi2(  4) =  142.04
         Prob > chi2 =    0.0000

. display ""


. 
. /*-----------------------------------------------------------------------------
> 7.2 ANÁLISIS ENTRE REGÍMENES TRIBUTARIOS (SOLO FORMALES)
> -----------------------------------------------------------------------------*/
. 
. // Comparación más limpia: SOLO empresas formales (RUC=1)
. // Objetivo: Evaluar si régimen tributario afecta supervivencia entre formales
. 
. display "═══════════════════════════════════════════════════════════════"
═══════════════════════════════════════════════════════════════

. display "ANÁLISIS ENTRE REGÍMENES TRIBUTARIOS (SOLO FORMALES RUC=1)"
ANÁLISIS ENTRE REGÍMENES TRIBUTARIOS (SOLO FORMALES RUC=1)

. display "═══════════════════════════════════════════════════════════════"
═══════════════════════════════════════════════════════════════

. 
. // Probabilidades predichas por régimen, CONDICIONADO a RUC=1
. margins regimen, at(ruc=1)

Predictive margins                                   Number of obs = 1,327,956
Model VCE: Robust

Expression: Pr(op2021_original), predict()
At: ruc = 1

---------------------------------------------------------------------------------------------------------
                                        |            Delta-method
                                        |     Margin   std. err.      z    P>|z|     [95% conf. interval]
----------------------------------------+----------------------------------------------------------------
                                regimen |
                               Ninguno  |   .4455927   .0138591    32.15   0.000     .4184294    .4727559
Nuevo Régimen Único Simplificado (RUS)  |   .5136868   .0109419    46.95   0.000     .4922412    .5351325
       Régimen Especial de Renta (RER)  |   .5009551   .0112297    44.61   0.000     .4789454    .5229648
         Régimen MYPE Tributario (RMT)  |   .5923208   .0138251    42.84   0.000     .5652242    .6194174
                  Régimen General (RG)  |   .7118589   .0313458    22.71   0.000     .6504223    .7732955
---------------------------------------------------------------------------------------------------------

. 
. // Visualización (solo formales)
. marginsplot, ///
>     title("Probabilidad de supervivencia por régimen tributario", size(medium)) ///
>     subtitle("Solo empresas formales (RUC=1)", size(small)) ///
>     ytitle("Pr(Operativa en 2021 | RUC=1)", size(small)) ///
>     xtitle("Régimen tributario", size(small)) ///
>     xlabel(1 "RUS" 2 "RER" 3 "RMT" 4 "RG", angle(45) labsize(small)) ///
>     ylabel(, format(%3.2f)) ///
>     note("RUS = Nuevo Régimen Único Simplificado (ventas <S/96k)" ///
>          "RER = Régimen Especial de Renta (ventas <S/525k)" ///
>          "RMT = Régimen MYPE Tributario (ventas <S/1,700k)" ///
>          "RG = Régimen General (sin límite de ventas)") ///
>     name(prob_regimen_formales, replace)

Variables that uniquely identify margins: regimen

. 
. // Tests pareados entre regímenes (solo formales)
. display ""


. display "Tests pareados de diferencias entre regímenes formales:"
Tests pareados de diferencias entre regímenes formales:

. display ""


. display "RUS vs RER:"
RUS vs RER:

. margins regimen, at(ruc=1) pwcompare(effects)

Pairwise comparisons of predictive margins           Number of obs = 1,327,956
Model VCE: Robust

Expression: Pr(op2021_original), predict()
At: ruc = 1

--------------------------------------------------------------------------------------------------------------------------
                                                         |            Delta-method    Unadjusted           Unadjusted
                                                         |   Contrast   std. err.      z    P>|z|     [95% conf. interval]
---------------------------------------------------------+----------------------------------------------------------------
                                                 regimen |
      Nuevo Régimen Único Simplificado (RUS) vs Ninguno  |   .0680942   .0094611     7.20   0.000     .0495507    .0866376
             Régimen Especial de Renta (RER) vs Ninguno  |   .0553624   .0153731     3.60   0.000     .0252317    .0854932
               Régimen MYPE Tributario (RMT) vs Ninguno  |   .1467281   .0184026     7.97   0.000     .1106597    .1827964
                        Régimen General (RG) vs Ninguno  |   .2662662   .0368646     7.22   0.000      .194013    .3385195
                        Régimen Especial de Renta (RER)  |
                                                     vs  |
                 Nuevo Régimen Único Simplificado (RUS)  |  -.0127317    .009217    -1.38   0.167    -.0307968    .0053333
                          Régimen MYPE Tributario (RMT)  |
                                                     vs  |
                 Nuevo Régimen Único Simplificado (RUS)  |   .0786339   .0125885     6.25   0.000     .0539609     .103307
                                   Régimen General (RG)  |
                                                     vs  |
                 Nuevo Régimen Único Simplificado (RUS)  |   .1981721   .0340461     5.82   0.000     .1314429    .2649012
                          Régimen MYPE Tributario (RMT)  |
                                                     vs  |
                        Régimen Especial de Renta (RER)  |   .0913657   .0098692     9.26   0.000     .0720225    .1107089
Régimen General (RG) vs Régimen Especial de Renta (RER)  |   .2109038   .0313296     6.73   0.000     .1494989    .2723087
  Régimen General (RG) vs Régimen MYPE Tributario (RMT)  |   .1195382   .0311081     3.84   0.000     .0585674    .1805089
--------------------------------------------------------------------------------------------------------------------------

. 
. // Efectos marginales discretos de cambiar de régimen
. // Interpretación: Cambio en Pr(supervivencia) al pasar del régimen base a otro
. display ""


. display "Efectos marginales discretos de régimen tributario (base: Ninguno):"
Efectos marginales discretos de régimen tributario (base: Ninguno):

. margins, dydx(regimen)

Average marginal effects                             Number of obs = 1,327,956
Model VCE: Robust

Expression: Pr(op2021_original), predict()
dy/dx wrt:  1.regimen 2.regimen 3.regimen 4.regimen

---------------------------------------------------------------------------------------------------------
                                        |            Delta-method
                                        |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
----------------------------------------+----------------------------------------------------------------
                                regimen |
Nuevo Régimen Único Simplificado (RUS)  |   .0679641   .0094619     7.18   0.000     .0494193     .086509
       Régimen Especial de Renta (RER)  |   .0552857   .0153562     3.60   0.000      .025188    .0853833
         Régimen MYPE Tributario (RMT)  |   .1459909   .0182149     8.01   0.000     .1102903    .1816914
                  Régimen General (RG)  |   .2637624   .0360837     7.31   0.000     .1930396    .3344852
---------------------------------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

. 
. /*-----------------------------------------------------------------------------
> 7.3 RÉGIMEN TRIBUTARIO POR REGIÓN
> -----------------------------------------------------------------------------*/
. 
. display ""


. display "═══════════════════════════════════════════════════════════════"
═══════════════════════════════════════════════════════════════

. display "RÉGIMEN TRIBUTARIO POR REGIÓN (SOLO FORMALES)"
RÉGIMEN TRIBUTARIO POR REGIÓN (SOLO FORMALES)

. display "═══════════════════════════════════════════════════════════════"
═══════════════════════════════════════════════════════════════

. 
. // Distribución de regímenes por región (solo formales)
. tab regimen region if ruc==1, col nofreq

                      |    Región geográfica del Perú
   Régimen Tributario |     Costa     Sierra      Selva |     Total
----------------------+---------------------------------+----------
              Ninguno |      9.20      12.58      10.93 |     10.36 
Nuevo Régimen Único S |     54.12      52.63      44.19 |     52.92 
Régimen Especial de R |      8.22       7.75      21.21 |      9.06 
Régimen MYPE Tributar |     11.34       8.48      11.67 |     10.50 
 Régimen General (RG) |     17.11      18.57      12.00 |     17.17 
----------------------+---------------------------------+----------
                Total |    100.00     100.00     100.00 |    100.00 

. 
. // Probabilidades predichas por régimen y región (solo formales)
. margins region#regimen, at(ruc=1)

Predictive margins                                   Number of obs = 1,327,956
Model VCE: Robust

Expression: Pr(op2021_original), predict()
At: ruc = 1

----------------------------------------------------------------------------------------------------------------
                                               |            Delta-method
                                               |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-----------------------------------------------+----------------------------------------------------------------
                                region#regimen |
                                Costa#Ninguno  |     .46088   .0154174    29.89   0.000     .4306625    .4910974
 Costa#Nuevo Régimen Único Simplificado (RUS)  |   .5292209   .0121421    43.59   0.000     .5054229    .5530189
        Costa#Régimen Especial de Renta (RER)  |   .5164862   .0120849    42.74   0.000     .4928002    .5401723
          Costa#Régimen MYPE Tributario (RMT)  |   .6074277    .013831    43.92   0.000     .5803193     .634536
                   Costa#Régimen General (RG)  |   .7248237   .0301422    24.05   0.000      .665746    .7839013
                               Sierra#Ninguno  |   .4225645   .0123913    34.10   0.000      .398278     .446851
Sierra#Nuevo Régimen Único Simplificado (RUS)  |   .4903073   .0115486    42.46   0.000     .4676724    .5129421
       Sierra#Régimen Especial de Renta (RER)  |   .4775766    .012867    37.12   0.000     .4523578    .5027953
         Sierra#Régimen MYPE Tributario (RMT)  |   .5696008   .0160485    35.49   0.000     .5381463    .6010553
                  Sierra#Régimen General (RG)  |   .6923738   .0348475    19.87   0.000      .624074    .7606737
                                Selva#Ninguno  |   .4258357   .0178157    23.90   0.000     .3909176    .4607538
 Selva#Nuevo Régimen Único Simplificado (RUS)  |   .4936613   .0131176    37.63   0.000     .4679514    .5193713
        Selva#Régimen Especial de Renta (RER)  |   .4809243   .0113812    42.26   0.000     .4586175     .503231
          Selva#Régimen MYPE Tributario (RMT)  |   .5728976   .0147932    38.73   0.000     .5439035    .6018918
                   Selva#Régimen General (RG)  |   .6952511    .028663    24.26   0.000     .6390725    .7514296
----------------------------------------------------------------------------------------------------------------

. 
. // Visualización: Interacción región × régimen
. marginsplot, ///
>     title("Probabilidad de supervivencia: Región × Régimen tributario", size(medium)) ///
>     subtitle("Solo empresas formales (RUC=1)", size(small)) ///
>     ytitle("Pr(Operativa en 2021 | RUC=1)", size(small)) ///
>     xlabel(1 "RUS" 2 "RER" 3 "RMT" 4 "RG", angle(45) labsize(small)) ///
>     ylabel(, format(%3.2f)) ///
>     legend(cols(3) size(small) order(1 "Costa" 2 "Sierra" 3 "Selva")) ///
>     note("Patrones regionales en probabilidad de supervivencia según régimen tributario" ///
>          "Separación vertical indica diferencias regionales en efecto del régimen") ///
>     name(region_regimen, replace)

Variables that uniquely identify margins: region regimen

. 
. // Interpretación guiada
. display ""


. display "═══════════════════════════════════════════════════════════════"
═══════════════════════════════════════════════════════════════

. display "INTERPRETACIÓN: RÉGIMEN TRIBUTARIO Y SUPERVIVENCIA"
INTERPRETACIÓN: RÉGIMEN TRIBUTARIO Y SUPERVIVENCIA

. display "═══════════════════════════════════════════════════════════════"
═══════════════════════════════════════════════════════════════

. display "1. Régimen 0 (Ninguno) vs 1-4 (Formales): Captura efecto formalización"
1. Régimen 0 (Ninguno) vs 1-4 (Formales): Captura efecto formalización

. display "2. Entre regímenes 1-4: Captura efecto de complejidad tributaria"
2. Entre regímenes 1-4: Captura efecto de complejidad tributaria

. display "   - RUS (más simple) → RER → RMT → RG (más complejo)"
   - RUS (más simple) → RER → RMT → RG (más complejo)

. display "   - Complejidad correlaciona con tamaño/ventas de empresa"
   - Complejidad correlaciona con tamaño/ventas de empresa

. display "3. Diferencias regionales: ¿Varía impacto de régimen según ubicación?"
3. Diferencias regionales: ¿Varía impacto de régimen según ubicación?

. display "4. ADVERTENCIA: Régimen es endógeno (empresas eligen según ventas/costos)"
4. ADVERTENCIA: Régimen es endógeno (empresas eligen según ventas/costos)

. display "   → Interpretación: Asociaciones condicionales, NO efectos causales"
   → Interpretación: Asociaciones condicionales, NO efectos causales

. display "═══════════════════════════════════════════════════════════════"
═══════════════════════════════════════════════════════════════

. display ""


. 
end of do-file

. cls

. do "/var/folders/zq/3f506wxj6djb98qwd23px8lh0000gn/T//SD46295.000000"

. /*=============================================================================
> 8. ANÁLISIS DE ROBUSTEZ
> =============================================================================*/
. 
. /*-----------------------------------------------------------------------------
> REFERENCIAS BIBLIOGRÁFICAS:
> 
> [1] Cameron, A. C., & Miller, D. L. (2015). "A Practitioner's Guide to
>     Cluster-Robust Inference." Journal of Human Resources, 50(2), 317-372.
>     DOI: 10.3368/jhr.50.2.317
> 
> [2] Lee, D. S., & Lemieux, T. (2010). "Regression Discontinuity Designs in
>     Economics." Journal of Economic Literature, 48(2), 281-355.
>     DOI: 10.1257/jel.48.2.281
> 
> [3] Calonico, S., Cattaneo, M. D., & Farrell, M. H. (2020). "Optimal Bandwidth
>     Choice for Robust Bias-Corrected Inference in Regression Discontinuity
>     Designs." The Econometrics Journal, 23(2), 192-210.
>     DOI: 10.1093/ectj/utz022
> 
> [4] Imbens, G. W., & Kalyanaraman, K. (2012). "Optimal Bandwidth Choice for
>     the Regression Discontinuity Estimator." The Review of Economic Studies,
>     79(3), 933-959.
>     DOI: 10.1093/restud/rdr043
> 
> [5] McCrary, J. (2008). "Manipulation of the Running Variable in the Regression
>     Discontinuity Design: A Density Test." Journal of Econometrics, 142(2),
>     698-714.
>     DOI: 10.1016/j.jeconom.2007.05.005
> -----------------------------------------------------------------------------*/
. 
. // Guardar estimaciones del modelo completo
. estimates save "modelo_completo.ster", replace
file modelo_completo.ster saved

. 
. /*-----------------------------------------------------------------------------
> 8.1 ROBUSTEZ: CLUSTERING A DIFERENTES NIVELES (CIIU)
> 
> Referencia: Cameron & Miller (2015) [1]
> Objetivo: Verificar que inferencia no dependa del nivel de agregación sectorial
> Interpretación: Si coeficientes mantienen significancia → resultados robustos
> 
> Modelo principal usa CIIU 4 dígitos (Clase, máxima granularidad disponible)
> Justificación: Recomendación del asesor dado tamaño censal (N=1,377,931)
> 
> Niveles alternativos de clustering probados:
> - CIIU 2 dígitos (División): ~21 clusters, agregación sectorial amplia
> - CIIU 3 dígitos (Grupo): ~88 clusters, agregación media
> - CIIU 4 dígitos (Clase): ~300+ clusters, desagregación estándar
> - Región geográfica: 3 clusters, máximo conservadurismo (errores más grandes)
> 
> Expectativa: CIIU 2 dígitos → errores estándar más grandes (conservador)
>              CIIU 4 dígitos → errores estándar más pequeños (eficiente)
> -----------------------------------------------------------------------------*/
. 
. // Modelo principal usa CIIU 4 dígitos
. estimates restore modelo_principal
(results modelo_principal are active now)

. 
. // Robustez 1: CIIU 2 dígitos (División sectorial, máxima agregación)
. logit op2021_original c.ruc##(i.region) ventas_std i.sector sexo_gerente productividad_k digital_score tributos_k salarios_k i
> .tipo_local i.regimen, vce(cluster ciiu_2dig)

Iteration 0:  Log pseudolikelihood = -919800.61  
Iteration 1:  Log pseudolikelihood = -877875.63  
Iteration 2:  Log pseudolikelihood =  -877201.6  
Iteration 3:  Log pseudolikelihood =  -877190.2  
Iteration 4:  Log pseudolikelihood = -877190.14  
Iteration 5:  Log pseudolikelihood = -877190.14  

Logistic regression                                  Number of obs = 1,327,956
                                                     Wald chi2(19) =   8391.34
                                                     Prob > chi2   =    0.0000
Log pseudolikelihood = -877190.14                    Pseudo R2     =    0.0463

                                                        (Std. err. adjusted for 73 clusters in ciiu_2dig)
---------------------------------------------------------------------------------------------------------
                                        |               Robust
                        op2021_original | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
----------------------------------------+----------------------------------------------------------------
                                    ruc |  -.2160872   .0389362    -5.55   0.000    -.2924009   -.1397736
                                        |
                                 region |
                                Sierra  |  -.4231821   .0201494   -21.00   0.000    -.4626741     -.38369
                                 Selva  |  -.1344804   .0468407    -2.87   0.004    -.2262864   -.0426743
                                        |
                           region#c.ruc |
                                Sierra  |   .2622429   .0448784     5.84   0.000     .1742828     .350203
                                 Selva  |   -.012587   .0436676    -0.29   0.773     -.098174        .073
                                        |
                             ventas_std |    .145499   .0233694     6.23   0.000     .0996958    .1913022
                                        |
                                 sector |
                            Productivo  |  -.0426904   .1272725    -0.34   0.737      -.29214    .2067592
                             Servicios  |  -.0491771   .0574604    -0.86   0.392    -.1617974    .0634431
                                        |
                           sexo_gerente |   .0321469   .0440859     0.73   0.466    -.0542599    .1185537
                        productividad_k |   .0131288   .0026182     5.01   0.000     .0079972    .0182604
                          digital_score |  -.1109475   .0395773    -2.80   0.005    -.1885176   -.0333775
                             tributos_k |  -.0001825   .0002367    -0.77   0.441    -.0006464    .0002814
                             salarios_k |   .0000544   .0001112     0.49   0.625    -.0001635    .0002723
                                        |
                             tipo_local |
                             Alquilado  |  -.4589818   .0917151    -5.00   0.000      -.63874   -.2792236
                                  Otro  |  -.4239409   .0788543    -5.38   0.000    -.5784925   -.2693894
                                        |
                                regimen |
Nuevo Régimen Único Simplificado (RUS)  |   .2830046   .0413155     6.85   0.000     .2020278    .3639815
       Régimen Especial de Renta (RER)  |   .2302953   .0652526     3.53   0.000     .1024025     .358188
         Régimen MYPE Tributario (RMT)  |   .6122861   .1041984     5.88   0.000      .408061    .8165111
                  Régimen General (RG)  |   1.157923   .2507209     4.62   0.000     .6665194    1.649327
                                        |
                                  _cons |   .1814816    .058495     3.10   0.002     .0668336    .2961297
---------------------------------------------------------------------------------------------------------

. estimates store robustez_ciiu2

. 
. // Robustez 2: CIIU 3 dígitos (Grupo sectorial, agregación media)
. logit op2021_original c.ruc##(i.region) ventas_std i.sector sexo_gerente productividad_k digital_score tributos_k salarios_k i
> .tipo_local i.regimen, vce(cluster ciiu_3dig)

Iteration 0:  Log pseudolikelihood = -919800.61  
Iteration 1:  Log pseudolikelihood = -877875.63  
Iteration 2:  Log pseudolikelihood =  -877201.6  
Iteration 3:  Log pseudolikelihood =  -877190.2  
Iteration 4:  Log pseudolikelihood = -877190.14  
Iteration 5:  Log pseudolikelihood = -877190.14  

Logistic regression                                  Number of obs = 1,327,956
                                                     Wald chi2(19) =   2080.38
                                                     Prob > chi2   =    0.0000
Log pseudolikelihood = -877190.14                    Pseudo R2     =    0.0463

                                                       (Std. err. adjusted for 196 clusters in ciiu_3dig)
---------------------------------------------------------------------------------------------------------
                                        |               Robust
                        op2021_original | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
----------------------------------------+----------------------------------------------------------------
                                    ruc |  -.2160872   .0742852    -2.91   0.004    -.3616835    -.070491
                                        |
                                 region |
                                Sierra  |  -.4231821   .0638794    -6.62   0.000    -.5483834   -.2979807
                                 Selva  |  -.1344804    .061549    -2.18   0.029    -.2551142   -.0138466
                                        |
                           region#c.ruc |
                                Sierra  |   .2622429   .0813656     3.22   0.001     .1027693    .4217166
                                 Selva  |   -.012587    .080321    -0.16   0.875    -.1700132    .1448392
                                        |
                             ventas_std |    .145499   .0222563     6.54   0.000     .1018774    .1891206
                                        |
                                 sector |
                            Productivo  |  -.0426904   .1123707    -0.38   0.704    -.2629329    .1775521
                             Servicios  |  -.0491771   .0674414    -0.73   0.466    -.1813598    .0830055
                                        |
                           sexo_gerente |   .0321469   .0340724     0.94   0.345    -.0346338    .0989276
                        productividad_k |   .0131288   .0022269     5.90   0.000     .0087641    .0174935
                          digital_score |  -.1109475    .025084    -4.42   0.000    -.1601113   -.0617837
                             tributos_k |  -.0001825    .000277    -0.66   0.510    -.0007254    .0003604
                             salarios_k |   .0000544   .0000707     0.77   0.442    -.0000843    .0001931
                                        |
                             tipo_local |
                             Alquilado  |  -.4589818   .0667469    -6.88   0.000    -.5898032   -.3281604
                                  Otro  |  -.4239409    .089759    -4.72   0.000    -.5998653   -.2480165
                                        |
                                regimen |
Nuevo Régimen Único Simplificado (RUS)  |   .2830046   .0365961     7.73   0.000     .2112776    .3547317
       Régimen Especial de Renta (RER)  |   .2302953    .069979     3.29   0.001     .0931389    .3674517
         Régimen MYPE Tributario (RMT)  |   .6122861   .0836703     7.32   0.000     .4482953    .7762768
                  Régimen General (RG)  |   1.157923   .1849963     6.26   0.000     .7953372    1.520509
                                        |
                                  _cons |   .1814816   .1009733     1.80   0.072    -.0164225    .3793858
---------------------------------------------------------------------------------------------------------

. estimates store robustez_ciiu3

. 
. // Robustez 3: CIIU 4 dígitos (Clase sectorial, desagregación estándar)
. logit op2021_original c.ruc##(i.region) ventas_std i.sector sexo_gerente productividad_k digital_score tributos_k salarios_k i
> .tipo_local i.regimen, vce(cluster ciiu_4dig)

Iteration 0:  Log pseudolikelihood = -919800.61  
Iteration 1:  Log pseudolikelihood = -877875.63  
Iteration 2:  Log pseudolikelihood =  -877201.6  
Iteration 3:  Log pseudolikelihood =  -877190.2  
Iteration 4:  Log pseudolikelihood = -877190.14  
Iteration 5:  Log pseudolikelihood = -877190.14  

Logistic regression                                  Number of obs = 1,327,956
                                                     Wald chi2(19) =   1581.95
                                                     Prob > chi2   =    0.0000
Log pseudolikelihood = -877190.14                    Pseudo R2     =    0.0463

                                                       (Std. err. adjusted for 335 clusters in ciiu_4dig)
---------------------------------------------------------------------------------------------------------
                                        |               Robust
                        op2021_original | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
----------------------------------------+----------------------------------------------------------------
                                    ruc |  -.2160872   .0801533    -2.70   0.007    -.3731848   -.0589897
                                        |
                                 region |
                                Sierra  |  -.4231821   .0594118    -7.12   0.000     -.539627   -.3067371
                                 Selva  |  -.1344804   .0396178    -3.39   0.001    -.2121298   -.0568309
                                        |
                           region#c.ruc |
                                Sierra  |   .2622429   .0743699     3.53   0.000     .1164807    .4080052
                                 Selva  |   -.012587   .0628289    -0.20   0.841    -.1357294    .1105554
                                        |
                             ventas_std |    .145499   .0222635     6.54   0.000     .1018633    .1891347
                                        |
                                 sector |
                            Productivo  |  -.0426904    .103493    -0.41   0.680    -.2455329    .1601521
                             Servicios  |  -.0491771   .0809955    -0.61   0.544    -.2079254    .1095711
                                        |
                           sexo_gerente |   .0321469   .0333163     0.96   0.335    -.0331519    .0974456
                        productividad_k |   .0131288   .0019953     6.58   0.000     .0092181    .0170395
                          digital_score |  -.1109475   .0235251    -4.72   0.000    -.1570558   -.0648393
                             tributos_k |  -.0001825   .0002759    -0.66   0.508    -.0007233    .0003583
                             salarios_k |   .0000544    .000067     0.81   0.417    -.0000769    .0001857
                                        |
                             tipo_local |
                             Alquilado  |  -.4589818   .0681475    -6.74   0.000    -.5925484   -.3254152
                                  Otro  |  -.4239409   .0724621    -5.85   0.000    -.5659641   -.2819178
                                        |
                                regimen |
Nuevo Régimen Único Simplificado (RUS)  |   .2830046   .0398454     7.10   0.000      .204909    .3611002
       Régimen Especial de Renta (RER)  |   .2302953   .0643892     3.58   0.000     .1040948    .3564957
         Régimen MYPE Tributario (RMT)  |   .6122861   .0785644     7.79   0.000     .4583027    .7662694
                  Régimen General (RG)  |   1.157923   .1793555     6.46   0.000      .806393    1.509454
                                        |
                                  _cons |   .1814816   .1132584     1.60   0.109    -.0405008    .4034641
---------------------------------------------------------------------------------------------------------

. estimates store robustez_ciiu4

. 
. // Robustez 4: Clustering por región (3 clusters, máximo conservadurismo)
. // Esperar errores estándar muy grandes (pocos clusters)
. logit op2021_original c.ruc##(i.region) ventas_std i.sector sexo_gerente productividad_k digital_score tributos_k salarios_k i
> .tipo_local i.regimen, vce(cluster region)

Iteration 0:  Log pseudolikelihood = -919800.61  
Iteration 1:  Log pseudolikelihood = -877875.63  
Iteration 2:  Log pseudolikelihood =  -877201.6  
Iteration 3:  Log pseudolikelihood =  -877190.2  
Iteration 4:  Log pseudolikelihood = -877190.14  
Iteration 5:  Log pseudolikelihood = -877190.14  

Logistic regression                                  Number of obs = 1,327,956
                                                     Wald chi2(1)  =         .
                                                     Prob > chi2   =         .
Log pseudolikelihood = -877190.14                    Pseudo R2     =    0.0463

                                                            (Std. err. adjusted for 3 clusters in region)
---------------------------------------------------------------------------------------------------------
                                        |               Robust
                        op2021_original | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
----------------------------------------+----------------------------------------------------------------
                                    ruc |  -.2160872   .0577593    -3.74   0.000    -.3292934    -.102881
                                        |
                                 region |
                                Sierra  |  -.4231821   .0027677  -152.90   0.000    -.4286066   -.4177575
                                 Selva  |  -.1344804   .0037068   -36.28   0.000    -.1417455   -.1272152
                                        |
                           region#c.ruc |
                                Sierra  |   .2622429   .0133654    19.62   0.000     .2360473    .2884385
                                 Selva  |   -.012587   .0100644    -1.25   0.211    -.0323129    .0071388
                                        |
                             ventas_std |    .145499   .0129512    11.23   0.000     .1201151    .1708829
                                        |
                                 sector |
                            Productivo  |  -.0426904   .1642563    -0.26   0.795    -.3646269    .2792462
                             Servicios  |  -.0491771   .0188394    -2.61   0.009    -.0861018   -.0122525
                                        |
                           sexo_gerente |   .0321469    .036892     0.87   0.384    -.0401601    .1044538
                        productividad_k |   .0131288   .0010948    11.99   0.000     .0109829    .0152746
                          digital_score |  -.1109475   .0155178    -7.15   0.000    -.1413619   -.0805331
                             tributos_k |  -.0001825   .0002837    -0.64   0.520    -.0007386    .0003736
                             salarios_k |   .0000544   .0000436     1.25   0.212    -.0000311    .0001399
                                        |
                             tipo_local |
                             Alquilado  |  -.4589818   .0532459    -8.62   0.000    -.5633419   -.3546217
                                  Otro  |  -.4239409   .0296088   -14.32   0.000    -.4819732   -.3659087
                                        |
                                regimen |
Nuevo Régimen Único Simplificado (RUS)  |   .2830046   .0468227     6.04   0.000     .1912337    .3747755
       Régimen Especial de Renta (RER)  |   .2302953   .0982094     2.34   0.019     .0378083    .4227822
         Régimen MYPE Tributario (RMT)  |   .6122861    .045556    13.44   0.000      .522998    .7015741
                  Régimen General (RG)  |   1.157923   .2199608     5.26   0.000      .726808    1.589039
                                        |
                                  _cons |   .1814816      .0083    21.87   0.000     .1652139    .1977494
---------------------------------------------------------------------------------------------------------

. estimates store robustez_region

. 
. // Comparar coeficientes de interacción RUC×Región con diferentes niveles de clustering
. // Verificar: ¿Se mantiene significancia estadística independiente del clustering?
. // Patrón esperado: SE aumentan de CIIU-4 → CIIU-3 → CIIU-2 → Región
. // capture ssc install estout
. esttab modelo_principal robustez_ciiu4 robustez_ciiu3 robustez_ciiu2 robustez_region, ///
>     keep(ruc 1.region#c.ruc 2.region#c.ruc) ///
>     se star(* 0.10 ** 0.05 *** 0.01) b(%9.4f) stats(N ll, fmt(%9.0fc %9.1f))

--------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)   
             op2021_ori~l    op2021_ori~l    op2021_ori~l    op2021_ori~l    op2021_ori~l   
--------------------------------------------------------------------------------------------
op2021_ori~l                                                                                
ruc               -0.2161***      -0.2161***      -0.2161***      -0.2161***      -0.2161***
                 (0.0802)        (0.0802)        (0.0743)        (0.0389)        (0.0578)   

1.region#c~c       0.2622***       0.2622***       0.2622***       0.2622***       0.2622***
                 (0.0744)        (0.0744)        (0.0814)        (0.0449)        (0.0134)   

2.region#c~c      -0.0126         -0.0126         -0.0126         -0.0126         -0.0126   
                 (0.0628)        (0.0628)        (0.0803)        (0.0437)        (0.0101)   
--------------------------------------------------------------------------------------------
N               1,327,956       1,327,956       1,327,956       1,327,956       1,327,956   
ll              -877190.1       -877190.1       -877190.1       -877190.1       -877190.1   
--------------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. 
. /*-----------------------------------------------------------------------------
> 8.2 ROBUSTEZ: REGRESSION DISCONTINUITY DESIGN EN UMBRAL RUS
> 
> Referencias: Lee & Lemieux (2010) [2], Calonico et al. (2020) [3],
>              Imbens & Kalyanaraman (2012) [4]
> 
> Marco legal: Nuevo Régimen Único Simplificado (RUS) - Ley 30296
> Umbral tributario: S/96,000 anuales (límite máximo ingresos brutos 2021)
> 
> Estrategia RDD:
> - Running variable: Distancia al umbral (ventas - 96,000)
> - Treatment: Estar sobre el umbral RUS (ventas ≥ S/96,000)
> - Outcome: Probabilidad de operar en 2021 (supervivencia empresarial)
> 
> Identificación causal: Empresas ligeramente arriba/abajo del umbral son
> comparables en observables y no-observables → discontinuidad en tratamiento
> permite estimar efecto causal del umbral tributario en supervivencia
> -----------------------------------------------------------------------------*/
. 
. // Crear variable de distancia al umbral (running variable)
. capture drop dist_umbral_rus

. gen dist_umbral_rus = ventas_soles_2021 - 96000

. label variable dist_umbral_rus "Distancia al umbral RUS (S/96,000)"

. 
. // Identificar empresas arriba/abajo del umbral (treatment variable)
. capture drop sobre_umbral

. gen sobre_umbral = (ventas_soles_2021 >= 96000) if !missing(ventas_soles_2021)

. label variable sobre_umbral "Ventas ≥ umbral RUS"

. 
. // RDD con bandwidth óptimo (±1 desviación estándar del umbral)
. // Siguiendo Imbens & Kalyanaraman (2012) para bandwidth MSE-óptimo
. quietly summarize dist_umbral_rus if abs(dist_umbral_rus) < 50000

. local bandwidth = r(sd)

. display "Bandwidth óptimo (±1 SD): ±" round(`bandwidth', 1) " soles"
Bandwidth óptimo (±1 SD): ±22603 soles

. 
. // Análisis local alrededor del umbral con 3 bandwidths diferentes
. // Robustez según Calonico et al. (2020): Probar múltiples bandwidths
. 
. // Bandwidth 1: ±15,000 (estrecho, menor sesgo, mayor varianza)
. preserve

. keep if abs(dist_umbral_rus) <= 15000
(1,344,519 observations deleted)

. logit op2021_original i.sobre_umbral productividad_k digital_score i.sector i.regimen, vce(cluster ciiu_4dig)

Iteration 0:  Log pseudolikelihood = -21075.257  
Iteration 1:  Log pseudolikelihood = -20879.913  
Iteration 2:  Log pseudolikelihood = -20879.536  
Iteration 3:  Log pseudolikelihood = -20879.536  

Logistic regression                                     Number of obs = 33,014
                                                        Wald chi2(9)  =  51.50
                                                        Prob > chi2   = 0.0000
Log pseudolikelihood = -20879.536                       Pseudo R2     = 0.0093

                                                       (Std. err. adjusted for 255 clusters in ciiu_4dig)
---------------------------------------------------------------------------------------------------------
                                        |               Robust
                        op2021_original | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
----------------------------------------+----------------------------------------------------------------
                         1.sobre_umbral |   .1863983   .0535355     3.48   0.000     .0814707    .2913259
                        productividad_k |   .0020824   .0019532     1.07   0.286    -.0017458    .0059105
                          digital_score |    -.07492   .0503332    -1.49   0.137    -.1735713    .0237313
                                        |
                                 sector |
                            Productivo  |  -.0623401   .1641464    -0.38   0.704    -.3840611    .2593809
                             Servicios  |  -.1376437   .1600992    -0.86   0.390    -.4514325     .176145
                                        |
                                regimen |
Nuevo Régimen Único Simplificado (RUS)  |  -.1361062   .1053839    -1.29   0.197    -.3426548    .0704425
       Régimen Especial de Renta (RER)  |   -.537961   .1096557    -4.91   0.000    -.7528821   -.3230399
         Régimen MYPE Tributario (RMT)  |   -.375942   .0914796    -4.11   0.000    -.5552388   -.1966452
                  Régimen General (RG)  |  -.0524155   .2408167    -0.22   0.828    -.5244075    .4195765
                                        |
                                  _cons |   .8026394   .1112058     7.22   0.000       .58468    1.020599
---------------------------------------------------------------------------------------------------------

. estimates store rdd_bw15k

. margins sobre_umbral

Predictive margins                                      Number of obs = 33,014
Model VCE: Robust

Expression: Pr(op2021_original), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
sobre_umbral |
          0  |   .6438092   .0164677    39.10   0.000     .6115332    .6760853
          1  |   .6849048   .0203507    33.66   0.000     .6450181    .7247914
------------------------------------------------------------------------------

. display "Observaciones bandwidth ±15k: " e(N)
Observaciones bandwidth ±15k: 33014

. restore

. 
. // Bandwidth 2: ±30,000 (medio, balanceo sesgo-varianza)
. preserve

. keep if abs(dist_umbral_rus) <= 30000
(1,244,463 observations deleted)

. logit op2021_original i.sobre_umbral productividad_k digital_score i.sector i.regimen, vce(cluster ciiu_4dig)

Iteration 0:  Log pseudolikelihood = -86876.014  
Iteration 1:  Log pseudolikelihood = -86157.227  
Iteration 2:  Log pseudolikelihood = -86156.302  
Iteration 3:  Log pseudolikelihood = -86156.302  

Logistic regression                                    Number of obs = 131,939
                                                       Wald chi2(9)  =   74.95
                                                       Prob > chi2   =  0.0000
Log pseudolikelihood = -86156.302                      Pseudo R2     =  0.0083

                                                       (Std. err. adjusted for 301 clusters in ciiu_4dig)
---------------------------------------------------------------------------------------------------------
                                        |               Robust
                        op2021_original | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
----------------------------------------+----------------------------------------------------------------
                         1.sobre_umbral |   .1953057   .0447279     4.37   0.000     .1076407    .2829708
                        productividad_k |    .000496   .0019437     0.26   0.799    -.0033136    .0043055
                          digital_score |  -.1231149   .0317264    -3.88   0.000    -.1852975   -.0609323
                                        |
                                 sector |
                            Productivo  |   .0541592    .153772     0.35   0.725    -.2472283    .3555468
                             Servicios  |  -.0358535   .1265925    -0.28   0.777    -.2839702    .2122632
                                        |
                                regimen |
Nuevo Régimen Único Simplificado (RUS)  |  -.1539512   .0946349    -1.63   0.104    -.3394323    .0315298
       Régimen Especial de Renta (RER)  |  -.4822594   .1082616    -4.45   0.000    -.6944483   -.2700705
         Régimen MYPE Tributario (RMT)  |  -.1776176   .0984105    -1.80   0.071    -.3704987    .0152634
                  Régimen General (RG)  |   .1553949   .1798324     0.86   0.388    -.1970701    .5078598
                                        |
                                  _cons |   .6852799    .118246     5.80   0.000     .4535221    .9170377
---------------------------------------------------------------------------------------------------------

. estimates store rdd_bw30k

. margins sobre_umbral

Predictive margins                                     Number of obs = 131,939
Model VCE: Robust

Expression: Pr(op2021_original), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
sobre_umbral |
          0  |   .6221973   .0139203    44.70   0.000     .5949139    .6494806
          1  |    .666475   .0184736    36.08   0.000     .6302674    .7026826
------------------------------------------------------------------------------

. display "Observaciones bandwidth ±30k: " e(N)
Observaciones bandwidth ±30k: 131939

. restore

. 
. // Bandwidth 3: ±50,000 (amplio, mayor sesgo, menor varianza)
. preserve

. keep if abs(dist_umbral_rus) <= 50000
(1,162,870 observations deleted)

. logit op2021_original i.sobre_umbral productividad_k digital_score i.sector i.regimen, vce(cluster ciiu_4dig)

Iteration 0:  Log pseudolikelihood = -139992.84  
Iteration 1:  Log pseudolikelihood = -138005.51  
Iteration 2:  Log pseudolikelihood = -137996.11  
Iteration 3:  Log pseudolikelihood =  -137996.1  

Logistic regression                                    Number of obs = 212,418
                                                       Wald chi2(9)  =   82.47
                                                       Prob > chi2   =  0.0000
Log pseudolikelihood = -137996.1                       Pseudo R2     =  0.0143

                                                       (Std. err. adjusted for 314 clusters in ciiu_4dig)
---------------------------------------------------------------------------------------------------------
                                        |               Robust
                        op2021_original | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
----------------------------------------+----------------------------------------------------------------
                         1.sobre_umbral |   .2015303   .0476325     4.23   0.000     .1081722    .2948883
                        productividad_k |   .0007673   .0020125     0.38   0.703    -.0031771    .0047118
                          digital_score |   -.161984   .0457002    -3.54   0.000    -.2515547   -.0724134
                                        |
                                 sector |
                            Productivo  |  -.1947579    .157226    -1.24   0.215    -.5029151    .1133993
                             Servicios  |  -.0117408   .1556682    -0.08   0.940    -.3168449    .2933632
                                        |
                                regimen |
Nuevo Régimen Único Simplificado (RUS)  |  -.1109277   .0919323    -1.21   0.228    -.2911117    .0692564
       Régimen Especial de Renta (RER)  |  -.4327923   .0994865    -4.35   0.000    -.6277823   -.2378024
         Régimen MYPE Tributario (RMT)  |  -.1101882   .0958404    -1.15   0.250     -.298032    .0776557
                  Régimen General (RG)  |   .5347924   .3130284     1.71   0.088     -.078732    1.148317
                                        |
                                  _cons |   .6327046   .1093662     5.79   0.000     .4183508    .8470583
---------------------------------------------------------------------------------------------------------

. estimates store rdd_bw50k

. margins sobre_umbral

Predictive margins                                     Number of obs = 212,418
Model VCE: Robust

Expression: Pr(op2021_original), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
sobre_umbral |
          0  |   .6222114   .0160883    38.67   0.000     .5906789    .6537439
          1  |   .6675204    .020639    32.34   0.000     .6270686    .7079721
------------------------------------------------------------------------------

. display "Observaciones bandwidth ±50k: " e(N)
Observaciones bandwidth ±50k: 212418

. restore

. 
. // Comparar estimaciones RDD con diferentes bandwidths
. // Interpretación: Si coeficiente sobre_umbral consistente → efecto causal robusto
. esttab rdd_bw15k rdd_bw30k rdd_bw50k, ///
>     keep(1.sobre_umbral productividad_k digital_score) ///
>     se star(* 0.10 ** 0.05 *** 0.01) b(%9.4f) stats(N ll, fmt(%9.0fc %9.1f))

------------------------------------------------------------
                      (1)             (2)             (3)   
             op2021_ori~l    op2021_ori~l    op2021_ori~l   
------------------------------------------------------------
op2021_ori~l                                                
1.sobre_um~l       0.1864***       0.1953***       0.2015***
                 (0.0535)        (0.0447)        (0.0476)   

productivi~k       0.0021          0.0005          0.0008   
                 (0.0020)        (0.0019)        (0.0020)   

digital_sc~e      -0.0749         -0.1231***      -0.1620***
                 (0.0503)        (0.0317)        (0.0457)   
------------------------------------------------------------
N                  33,014         131,939         212,418   
ll               -20879.5        -86156.3       -137996.1   
------------------------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. 
. /*-----------------------------------------------------------------------------
> 8.3 ROBUSTEZ: VALIDACIÓN DEL UMBRAL (PLACEBO TESTS)
> 
> Referencia: Lee & Lemieux (2010) [2] Section 5.3 "Specification Checks"
> 
> Objetivo: Verificar que el efecto observado en 8.2 es específico al umbral
> real (S/96,000) y no un artefacto estadístico o patrón general en ventas
> 
> Metodología: Estimar discontinuidades en umbrales "falsos" donde NO existe
> tratamiento tributario. Si RDD válido → placebos NO significativos
> 
> Test de falsificación:
> - H0: Coeficiente placebo = 0 (no hay discontinuidad en umbral falso)
> - H1: Coeficiente placebo ≠ 0 (diseño RDD potencialmente inválido)
> 
> Interpretación: Rechazar H0 en placebos invalida identificación causal del
> umbral real, sugiriendo patrones no-lineales en ventas no relacionados con
> régimen tributario
> -----------------------------------------------------------------------------*/
. 
. // Placebo test 1: Umbral falso en S/70,000 (debajo del RUS real)
. // Expectativa: NO significativo (no hay discontinuidad tributaria en S/70k)
. capture drop placebo_70k

. gen placebo_70k = (ventas_soles_2021 >= 70000) if !missing(ventas_soles_2021)

. preserve

. keep if ventas_soles_2021 > 50000 & ventas_soles_2021 < 90000
(1,241,212 observations deleted)

. logit op2021_original i.placebo_70k productividad_k digital_score i.sector, vce(cluster ciiu_4dig)

Iteration 0:  Log pseudolikelihood = -89980.926  
Iteration 1:  Log pseudolikelihood = -89769.491  
Iteration 2:  Log pseudolikelihood = -89769.413  
Iteration 3:  Log pseudolikelihood = -89769.413  

Logistic regression                                    Number of obs = 135,421
                                                       Wald chi2(5)  =   39.51
                                                       Prob > chi2   =  0.0000
Log pseudolikelihood = -89769.413                      Pseudo R2     =  0.0024

                               (Std. err. adjusted for 302 clusters in ciiu_4dig)
---------------------------------------------------------------------------------
                |               Robust
op2021_original | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
  1.placebo_70k |  -.0332357   .0666781    -0.50   0.618    -.1639225     .097451
productividad_k |   .0012722   .0021892     0.58   0.561    -.0030186    .0055631
  digital_score |  -.1426711   .0258239    -5.52   0.000     -.193285   -.0920573
                |
         sector |
    Productivo  |  -.0859641   .1549954    -0.55   0.579    -.3897496    .2178213
     Servicios  |  -.0656638   .1396175    -0.47   0.638    -.3393091    .2079816
                |
          _cons |   .5817464   .1237251     4.70   0.000     .3392497    .8242431
---------------------------------------------------------------------------------

. estimates store placebo_70k

. display "Placebo S/70,000 - Observaciones: " e(N)
Placebo S/70,000 - Observaciones: 135421

. restore

. 
. // Placebo test 2: Umbral falso en S/120,000 (encima del RUS, antes del RER)
. // Expectativa: NO significativo (no hay umbral tributario en S/120k)
. capture drop placebo_120k

. gen placebo_120k = (ventas_soles_2021 >= 120000) if !missing(ventas_soles_2021)

. preserve

. keep if ventas_soles_2021 > 100000 & ventas_soles_2021 < 140000
(1,355,360 observations deleted)

. logit op2021_original i.placebo_120k productividad_k digital_score i.sector, vce(cluster ciiu_4dig)

Iteration 0:  Log pseudolikelihood = -14284.743  
Iteration 1:  Log pseudolikelihood = -14124.855  
Iteration 2:  Log pseudolikelihood = -14124.615  
Iteration 3:  Log pseudolikelihood = -14124.615  

Logistic regression                                     Number of obs = 22,150
                                                        Wald chi2(5)  =  27.99
                                                        Prob > chi2   = 0.0000
Log pseudolikelihood = -14124.615                       Pseudo R2     = 0.0112

                               (Std. err. adjusted for 219 clusters in ciiu_4dig)
---------------------------------------------------------------------------------
                |               Robust
op2021_original | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
 1.placebo_120k |  -.3747339   .0742091    -5.05   0.000    -.5201811   -.2292866
productividad_k |  -.0049824   .0029287    -1.70   0.089    -.0107226    .0007578
  digital_score |  -.0834134   .0330786    -2.52   0.012    -.1482463   -.0185805
                |
         sector |
    Productivo  |  -.1664797   .2574543    -0.65   0.518    -.6710808    .3381214
     Servicios  |  -.1748931   .1431875    -1.22   0.222    -.4555354    .1057491
                |
          _cons |   1.036733   .1726934     6.00   0.000     .6982604    1.375206
---------------------------------------------------------------------------------

. estimates store placebo_120k

. display "Placebo S/120,000 - Observaciones: " e(N)
Placebo S/120,000 - Observaciones: 22150

. restore

. 
. // Placebo test 3: Umbral falso en S/200,000 (zona media entre RUS-RER)
. // Expectativa: NO significativo (no hay umbral tributario en S/200k)
. capture drop placebo_200k

. gen placebo_200k = (ventas_soles_2021 >= 200000) if !missing(ventas_soles_2021)

. preserve

. keep if ventas_soles_2021 > 175000 & ventas_soles_2021 < 225000
(1,364,499 observations deleted)

. logit op2021_original i.placebo_200k productividad_k digital_score i.sector, vce(cluster ciiu_4dig)

Iteration 0:  Log pseudolikelihood = -7834.8788  
Iteration 1:  Log pseudolikelihood = -7758.8948  
Iteration 2:  Log pseudolikelihood = -7758.5941  
Iteration 3:  Log pseudolikelihood = -7758.5941  

Logistic regression                                     Number of obs = 13,036
                                                        Wald chi2(5)  =  28.21
                                                        Prob > chi2   = 0.0000
Log pseudolikelihood = -7758.5941                       Pseudo R2     = 0.0097

                               (Std. err. adjusted for 218 clusters in ciiu_4dig)
---------------------------------------------------------------------------------
                |               Robust
op2021_original | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
 1.placebo_200k |  -.0448728   .0754216    -0.59   0.552    -.1926964    .1029508
productividad_k |   .0027087   .0028412     0.95   0.340      -.00286    .0082774
  digital_score |  -.2445451   .0593875    -4.12   0.000    -.3609423   -.1281478
                |
         sector |
    Productivo  |  -.2560496   .2402912    -1.07   0.287    -.7270118    .2149125
     Servicios  |   .0958727   .1855773     0.52   0.605    -.2678521    .4595975
                |
          _cons |   .9922696   .1759853     5.64   0.000     .6473448    1.337194
---------------------------------------------------------------------------------

. estimates store placebo_200k

. display "Placebo S/200,000 - Observaciones: " e(N)
Placebo S/200,000 - Observaciones: 13036

. restore

. 
. // Comparar placebos: NINGUNO debería ser significativo
. // Si algún placebo significativo → problema de especificación, no causalidad
. esttab placebo_70k placebo_120k placebo_200k, ///
>     keep(*placebo*) ///
>     se star(* 0.10 ** 0.05 *** 0.01) b(%9.4f) stats(N ll, fmt(%9.0fc %9.1f))

------------------------------------------------------------
                      (1)             (2)             (3)   
             op2021_ori~l    op2021_ori~l    op2021_ori~l   
------------------------------------------------------------
op2021_ori~l                                                
0.placeb~70k       0.0000                                   
                      (.)                                   

1.placeb~70k      -0.0332                                   
                 (0.0667)                                   

0.place~120k                       0.0000                   
                                      (.)                   

1.place~120k                      -0.3747***                
                                 (0.0742)                   

0.place~200k                                       0.0000   
                                                      (.)   

1.place~200k                                      -0.0449   
                                                 (0.0754)   
------------------------------------------------------------
N                 135,421          22,150          13,036   
ll               -89769.4        -14124.6         -7758.6   
------------------------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. 
. // Test formal de hipótesis: ¿Todos los placebos son conjuntamente no significativos?
. // Expectativa: No rechazar H0 (placebos = 0) para validar RDD del umbral real
. 
. /*-----------------------------------------------------------------------------
> 8.4 ROBUSTEZ: TEST DE MANIPULACIÓN (McCRARY DENSITY TEST)
> 
> Referencia: McCrary, J. (2008) [5] "Manipulation of the Running Variable in
>             the Regression Discontinuity Design: A Density Test"
> 
> Actualización: Cattaneo, M. D., Jansson, M., & Ma, X. (2020). "Simple Local
>                Polynomial Density Estimators." Journal of the American
>                Statistical Association, 115(531), 1449-1455.
> 
> Objetivo: Verificar si empresas manipulan reportes de ventas para permanecer
> debajo del umbral RUS (S/96,000) y evitar regímenes tributarios más complejos
> 
> Estrategia de evasión potencial:
> - Empresa con ventas reales S/98,000 → Reporta S/95,000 → Permanece en RUS
> - Evidencia: Acumulación anormal ("bunching") justo debajo del umbral
> - Consecuencia: Viola supuesto de continuidad en RDD → estimador sesgado
> 
> Test de hipótesis:
> - H0: Densidad continua en umbral (lim f(x) desde izquierda = lim f(x) desde derecha)
> - H1: Discontinuidad en densidad (manipulación sistemática)
> 
> Interpretación:
> - p-value > 0.05 → No rechazar H0 → No hay evidencia de manipulación → RDD válido
> - p-value ≤ 0.05 → Rechazar H0 → Manipulación detectada → RDD potencialmente inválido
> -----------------------------------------------------------------------------*/
. 
. // Instalar comando moderno para density test (si no está instalado)
. // capture ssc install rddensity
. // capture ssc install lpdensity
. 
. // Test McCrary con método Cattaneo et al. (2020)
. // Usa dist_umbral_rus como running variable con cutoff en 0
. rddensity dist_umbral_rus, c(0) plot
Computing data-driven bandwidth selectors.

Point estimates and standard errors have been adjusted for repeated observations.
(Use option nomasspoints to suppress this adjustment.)

RD Manipulation test using local polynomial density estimation.

     c =     0.000 | Left of c  Right of c          Number of obs =      1377931
-------------------+----------------------          Model         = unrestricted
     Number of obs |   1188324      189607          BW method     =         comb
Eff. Number of obs |      2364        3319          Kernel        =   triangular
    Order est. (p) |         2           2          VCE method    =    jackknife
    Order bias (q) |         3           3
       BW est. (h) |  3526.615    3532.314

Running variable: dist_umbral_rus.
------------------------------------------
            Method |      T          P>|T|
-------------------+----------------------
            Robust |    7.4966      0.0000
------------------------------------------

P-values of binomial tests. (H0: prob = .5)
-----------------------------------------------------
 Window Length / 2 |       <c         >=c |     P>|T|
-------------------+----------------------+----------
             0.000 |        0        1921 |    0.0000
             0.000 |        0        1921 |    0.0000
             0.000 |        0        1921 |    0.0000
             0.000 |        0        1921 |    0.0000
             0.000 |        0        1921 |    0.0000
             0.000 |        0        1921 |    0.0000
             0.000 |        0        1921 |    0.0000
             0.000 |        0        1921 |    0.0000
             0.000 |        0        1921 |    0.0000
             0.000 |        0        1921 |    0.0000
-----------------------------------------------------

. // c(0) porque dist_umbral_rus = ventas - 96000, entonces umbral está en 0
. 
. // Guardar resultado del test
. matrix mccrary_test = r(table)

. display "════════════════════════════════════════════════════════════"
════════════════════════════════════════════════════════════

. display "TEST DE MANIPULACIÓN McCRARY (2008)"
TEST DE MANIPULACIÓN McCRARY (2008)

. display "════════════════════════════════════════════════════════════"
════════════════════════════════════════════════════════════

. display "Hipótesis nula: Densidad continua en umbral (no manipulación)"
Hipótesis nula: Densidad continua en umbral (no manipulación)

. display "P-value: " r(pval_p)
P-value: .

. display ""


. if r(pval_p) > 0.05 {
.     display "✓ RESULTADO: No hay evidencia estadística de manipulación"
✓ RESULTADO: No hay evidencia estadística de manipulación
.     display "  → Diseño RDD es VÁLIDO para identificación causal"
  → Diseño RDD es VÁLIDO para identificación causal
. }

. else {
.     display "✗ ADVERTENCIA: Se detecta posible manipulación del umbral"
.     display "  → Resultados RDD deben interpretarse con CAUTELA"
.     display "  → Considerar estimadores robustos a manipulación (donut-hole RDD)"
. }

. display "════════════════════════════════════════════════════════════"
════════════════════════════════════════════════════════════

. display ""


. 
. // Método alternativo: Test McCrary original (DCdensity)
. // Requiere instalación: ssc install rddensity (ya incluye DCdensity)
. capture {

. 
. // Análisis visual de densidad alrededor del umbral
. // Gráfico de histograma con bins pequeños para detectar bunching
. preserve

. keep if abs(dist_umbral_rus) <= 50000
(1,162,870 observations deleted)

. histogram dist_umbral_rus, width(5000) frequency ///
>     xline(0, lcolor(red) lwidth(thick) lpattern(dash)) ///
>     title("Distribución de ventas alrededor del umbral RUS", size(medium)) ///
>     subtitle("Test visual de manipulación - McCrary (2008)") ///
>     xtitle("Distancia al umbral S/96,000 (soles)") ///
>     ytitle("Número de empresas") ///
>     note("Línea roja: Umbral RUS (S/96,000)" ///
>          "Bunching visible debajo del umbral sugiere manipulación estratégica") ///
>     name(bunching_test, replace)
(bin=20, start=-50000, width=5000)

. restore

. 
. // Contar empresas en ventanas simétricas alrededor del umbral
. // Si hay manipulación, debería haber más empresas justo debajo que justo encima
. quietly count if dist_umbral_rus >= -5000 & dist_umbral_rus < 0

. local n_below = r(N)

. quietly count if dist_umbral_rus >= 0 & dist_umbral_rus < 5000

. local n_above = r(N)

. local ratio = `n_below' / `n_above'

. 
. display "Empresas en ventana ±S/5,000 del umbral:"
Empresas en ventana ±S/5,000 del umbral:

. display "  Debajo umbral [-5k, 0): " `n_below' " empresas"
  Debajo umbral [-5k, 0): 3100 empresas

. display "  Encima umbral [0, +5k): " `n_above' " empresas"
  Encima umbral [0, +5k): 8954 empresas

. display "  Ratio (debajo/encima): " %5.2f `ratio'
  Ratio (debajo/encima):  0.35

. display ""


. if `ratio' > 1.2 {
.     display "⚠ ADVERTENCIA: Exceso de empresas debajo del umbral (ratio > 1.2)"
.     display "   Posible manipulación estratégica de ventas reportadas"
. }

. else if `ratio' < 0.8 {
.     display "ℹ NOTA: Menos empresas debajo que encima (ratio < 0.8)"
ℹ NOTA: Menos empresas debajo que encima (ratio < 0.8)
.     display "   Posible incentivo a reportar ventas mayores (inusual)"
   Posible incentivo a reportar ventas mayores (inusual)
. }

. else {
.     display "✓ Distribución balanceada alrededor del umbral (ratio ≈ 1.0)"
. }

. 
end of do-file

. cls

. do "/var/folders/zq/3f506wxj6djb98qwd23px8lh0000gn/T//SD46295.000000"

. /*=============================================================================
> 9. DIAGNÓSTICOS DEL MODELO
> =============================================================================*/
. 
. // Restaurar modelo principal para diagnósticos
. estimates restore modelo_principal
(results modelo_principal are active now)

. 
. // Capacidad predictiva
. capture drop phat

. predict phat, pr
(49,975 missing values generated)

. lroc, title("Capacidad Predictiva del Modelo") name(roc_curve, replace)

Logistic model for op2021_original

Number of observations =  1327956
Area under ROC curve   =   0.6367

. 
. // Sensibilidad y especificidad
. estat classification

Logistic model for op2021_original

              -------- True --------
Classified |         D            ~D  |      Total
-----------+--------------------------+-----------
     +     |    410288        268362  |     678650
     -     |    274754        374552  |     649306
-----------+--------------------------+-----------
   Total   |    685042        642914  |    1327956

Classified + if predicted Pr(D) >= .5
True D defined as op2021_original != 0
--------------------------------------------------
Sensitivity                     Pr( +| D)   59.89%
Specificity                     Pr( -|~D)   58.26%
Positive predictive value       Pr( D| +)   60.46%
Negative predictive value       Pr(~D| -)   57.68%
--------------------------------------------------
False + rate for true ~D        Pr( +|~D)   41.74%
False - rate for true D         Pr( -| D)   40.11%
False + rate for classified +   Pr(~D| +)   39.54%
False - rate for classified -   Pr( D| -)   42.32%
--------------------------------------------------
Correctly classified                        59.10%
--------------------------------------------------

. 
. // Bondad de ajuste
. estat ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |          N   ll(null)  ll(model)      df        AIC        BIC
-------------+---------------------------------------------------------------
modelo_pri~l |  1,327,956  -919800.6  -877190.1      20    1754420    1754662
-----------------------------------------------------------------------------
Note: BIC uses N = number of observations. See [R] IC note.

. 
. // Cerrar log
. log close
      name:  <unnamed>
       log:  /Users/leonardoleon/Library/Mobile Documents/com~apple~CloudDocs/Universidad/UPC/9no ciclo/Tesis 1/Base de datos 5t
> o censo económico anual/Base curada/analisis_supervivencia_$(S_DATE).log
  log type:  text
 closed on:   6 Oct 2025, 02:57:08
--------------------------------------------------------------------------------------------------------------------------------
